import React from 'react';

const ConciergeMainService: React.FC = () => {
    return (
        <div className="concierge-service">
            <div className="concierge-service-title">
                <h2 className="concierge-service-title__title">Как это работает?</h2>

                <p className="concierge-service-title__description">
                    Отправьте нам заявку, указав ссылку на&nbsp;любую желаемую сумку, украшение, часы. В&nbsp;течение
                    суток мы&nbsp;вернемся к&nbsp;вам с&nbsp;актуальной ценой и&nbsp;ответим на&nbsp;все вопросы. После
                    предоплаты мы&nbsp;доставим покупку к&nbsp;вам&nbsp;&mdash; это займет около 14&nbsp;дней. Внимание:
                    покупки, сделанные с&nbsp;помощью консьерж-сервиса, не&nbsp;подлежат возврату.
                </p>
            </div>

            <div className="concierge-service-text">
                <div className="concierge-service-text-block">
                    <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M9.06351 8.767C9.1638 9.16889 9.57091 9.41337 9.97279 9.31308C10.3747 9.21278 10.6192 8.80568 10.5189 8.40379L9.06351 8.767ZM9.38785 6.96926L10.1155 6.78765L9.38785 6.96926ZM15.3439 6.96926L14.6163 6.78765V6.78765L15.3439 6.96926ZM14.3873 3.90927L13.893 4.47328L14.3873 3.90927ZM10.3445 3.90927L9.85012 3.34526V3.34526L10.3445 3.90927ZM6.06755 19.4149L5.3674 19.6838H5.3674L6.06755 19.4149ZM8.2565 8.43306L7.91477 7.76544L7.81093 7.81859L7.72813 7.90077L8.2565 8.43306ZM18.9325 19.4149L19.6326 19.6838H19.6326L18.9325 19.4149ZM16.7435 8.43306L17.2719 7.90077L17.1891 7.81859L17.0852 7.76544L16.7435 8.43306ZM12.3659 3.14844L12.3659 3.89844L12.3659 3.14844ZM14.2129 8.40379C14.1126 8.80568 14.3571 9.21278 14.759 9.31308C15.1609 9.41337 15.568 9.16889 15.6683 8.767L14.2129 8.40379ZM10.5189 8.40379L10.1155 6.78765L8.66017 7.15086L9.06351 8.767L10.5189 8.40379ZM13.893 4.47328C14.548 5.0474 14.8276 5.94097 14.6163 6.78765L16.0716 7.15086C16.4189 5.75955 15.9598 4.29022 14.8817 3.34526L13.893 4.47328ZM10.1155 6.78765C9.90423 5.94097 10.1838 5.0474 10.8388 4.47328L9.85012 3.34526C8.77204 4.29022 8.31294 5.75955 8.66017 7.15086L10.1155 6.78765ZM6.7677 19.146C6.20351 17.6769 6.09907 15.7194 6.46106 13.802C6.82325 11.8835 7.63251 10.1092 8.78486 8.96535L7.72813 7.90077C6.29786 9.32051 5.3867 11.4071 4.9871 13.5237C4.58729 15.6414 4.67969 17.893 5.3674 19.6838L6.7677 19.146ZM8.59823 9.10069C9.61324 8.58115 10.9015 8.00315 12.6143 8.04829L12.6538 6.54881C10.5587 6.49359 8.99608 7.21197 7.91477 7.76544L8.59823 9.10069ZM12.6417 20.3985C11.1311 20.383 9.65075 20.2171 8.51799 19.9366C7.94936 19.7959 7.49767 19.6333 7.18083 19.464C7.02354 19.38 6.91606 19.303 6.84739 19.2396C6.77846 19.1759 6.76627 19.1423 6.7677 19.146L5.3674 19.6838C5.56661 20.2025 6.03145 20.5506 6.47398 20.7871C6.94099 21.0366 7.52331 21.2357 8.15753 21.3927C9.43048 21.7078 11.0312 21.8821 12.6264 21.8984L12.6417 20.3985ZM19.6326 19.6838C20.3203 17.893 20.4127 15.6414 20.0129 13.5237C19.6133 11.4071 18.7021 9.32051 17.2719 7.90077L16.2151 8.96535C17.3675 10.1092 18.1767 11.8835 18.5389 13.802C18.9009 15.7194 18.7965 17.6769 18.2323 19.146L19.6326 19.6838ZM17.0852 7.76544C16.0039 7.21197 14.4413 6.49359 12.3462 6.54881L12.3857 8.04829C14.0985 8.00315 15.3868 8.58115 16.4018 9.10069L17.0852 7.76544ZM12.3736 21.8984C13.9688 21.8821 15.5695 21.7078 16.8425 21.3927C17.4767 21.2357 18.059 21.0366 18.526 20.7871C18.9685 20.5506 19.4334 20.2025 19.6326 19.6838L18.2323 19.146C18.2337 19.1423 18.2215 19.1759 18.1526 19.2396C18.0839 19.303 17.9765 19.38 17.8192 19.464C17.5023 19.6333 17.0506 19.7959 16.482 19.9366C15.3492 20.2171 13.8689 20.383 12.3583 20.3985L12.3736 21.8984ZM10.8388 4.47328C11.2763 4.08985 11.8204 3.89843 12.3659 3.89844L12.3659 2.39844C11.4687 2.39843 10.57 2.71424 9.85012 3.34526L10.8388 4.47328ZM12.3659 3.89844C12.9114 3.89844 13.4555 4.08986 13.893 4.47328L14.8817 3.34526C14.1618 2.71425 13.2632 2.39844 12.3659 2.39844L12.3659 3.89844ZM15.6683 8.767L16.0716 7.15086L14.6163 6.78765L14.2129 8.40379L15.6683 8.767Z"
                            fill="#070707"
                        />
                    </svg>

                    <div className="concierge-service-text-block-text">
                        <h3 className="concierge-service-text-block-text__title">Любые позиции</h3>

                        <p className="concierge-service-text-block-text__subtitle">
                            Вы&nbsp;можете выбрать для доставки сумку, часы, украшения, обувь, одежду культовых марок,
                            от&nbsp;Bottega Veneta и&nbsp;Bvlgari до&nbsp;Valentino и&nbsp;Van Cleef &amp;&nbsp;Arpels.
                        </p>
                    </div>
                </div>

                <div className="concierge-service-text-block">
                    <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M8.5 10.3484H15.7M8.5 13.9484H13M4 10.3484C4 6.95454 4 5.25714 5.0548 4.20324C6.1087 3.14844 7.8061 3.14844 11.2 3.14844H13C16.3939 3.14844 18.0913 3.14844 19.1452 4.20324C20.2 5.25714 20.2 6.95454 20.2 10.3484V13.9484C20.2 17.3423 20.2 19.0397 19.1452 20.0936C18.0913 21.1484 16.3939 21.1484 13 21.1484H11.2C7.8061 21.1484 6.1087 21.1484 5.0548 20.0936C4 19.0397 4 17.3423 4 13.9484V10.3484Z"
                            stroke="#070707"
                            strokeWidth="1.5"
                            strokeLinecap="round"
                        />
                    </svg>

                    <div className="concierge-service-text-block-text">
                        <h3 className="concierge-service-text-block-text__title">Гарантия подлинности</h3>

                        <p className="concierge-service-text-block-text__subtitle">
                            Консьерж-сервис THE CULTT работает только с&nbsp;официальными сайтами и&nbsp;магазинами
                            брендов и&nbsp;гарантирует подлинность каждого изделия.
                        </p>
                    </div>
                </div>

                <div className="concierge-service-text-block">
                    <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M20.5 7.14844L9.5 18.1484L4.5 13.1484"
                            stroke="#070707"
                            strokeWidth="2"
                            strokeLinecap="round"
                            strokeLinejoin="round"
                        />
                    </svg>

                    <div className="concierge-service-text-block-text">
                        <h3 className="concierge-service-text-block-text__title">Безопасная покупка</h3>

                        <p className="concierge-service-text-block-text__subtitle">
                            THE CULTT гарантирует возврат средств, если покупка не будет доставлена.
                        </p>
                    </div>
                </div>
            </div>
        </div>
    );
};

export default ConciergeMainService;
