'use client';

import React from 'react';
import { useMediaQuery } from 'usehooks-ts';

import { BaseImage, CinemaArtisticFormSubscribe } from '@/components';
import { MEDIA_SIZES } from '@/constants/styles';

import { sendMindbox } from '@/functions/mindbox';

import CinemaArtisticExhibit1Cover from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-1-cover.jpg';
import CinemaArtisticExhibit1CoverMedia from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-1-cover-media.jpg';
import CinemaArtisticExhibit1Image from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-1-image.jpg';

import CinemaArtisticExhibit2Cover from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-2-cover.jpg';
import CinemaArtisticExhibit2CoverMedia from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-2-cover-media.jpg';
import CinemaArtisticExhibit2Image from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-2-image.jpg';

import CinemaArtisticExhibit3Cover from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-3-cover.jpg';
import CinemaArtisticExhibit3CoverMedia from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-3-cover-media.jpg';
import CinemaArtisticExhibit3Image from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-3-image.jpg';

import CinemaArtisticExhibit4Cover from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-4-cover.jpg';
import CinemaArtisticExhibit4CoverMedia from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-4-cover-media.jpg';
import CinemaArtisticExhibit4Image from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-4-image.jpg';

import CinemaArtisticExhibit5Cover from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-5-cover.jpg';
import CinemaArtisticExhibit5CoverMedia from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-5-cover-media.jpg';
import CinemaArtisticExhibit5Image from '@/assets/images/cinema-artistic/cinema-artistic-exhibit-5-image.jpg';

import CinemaArtisticRedImage from '@/assets/images/cinema-artistic/cinema-artistic-red.jpg';
import CinemaArtisticRedTabletImage from '@/assets/images/cinema-artistic/cinema-artistic-red__tablet.jpg';
import CinemaArtisticRedMobileImage from '@/assets/images/cinema-artistic/cinema-artistic-red__mobile.jpg';

const exhibits = [
    {
        cover: CinemaArtisticExhibit1Cover.src,
        coverMedia: CinemaArtisticExhibit1CoverMedia.src,
        option: {
            title: 'HERMÈS BIRKIN',
            year: '1984',
            film: '«СЕМЕЙКА ТЕНЕБАНБАУМ», 2001',
        },
        description1: `В&nbsp;1984-м певица, актриса и&nbsp;главная it-girl 70-х, Джейн Биркин, летела в&nbsp;Париж.Когда она попыталась поставить свою корзинку на&nbsp;пол, все содержимое рассыпалось по&nbsp;салону. Рядом сидел представитель Herm&egrave;s Жан-Луи Дюма, который предложил Джейн Биркин поучаствовать в&nbsp;создании новой вместительной модели. Прямо в&nbsp;самолете они набросали эскиз сумки, основываясь на&nbsp;культовой модели Kelly, и&nbsp;вскоре посылка с&nbsp;готовым аксессуаром, названным в&nbsp;честь Биркин, оказалась у&nbsp;ее&nbsp;порога.`,
        image: CinemaArtisticExhibit1Image.src,
        description2: `Сумка Birkin, с&nbsp;которой ходит Марго Тененбаум (Гвинет Пэлтроу) в&nbsp;фильме &laquo;Семейка Тененбаум&raquo;, была, вероятнее всего, подарена ей&nbsp;матерью, появившейся в&nbsp;фильме с&nbsp;более строгой и&nbsp;взрослой Herm&egrave;s Kelly. Стиль Марго отражает ее&nbsp;драму ребенка-вундеркинда. Став взрослой, она все еще носит свою дорогую детскую униформу: шубу Fendi, платье для тенниса Lacoste, лоферы Gucci и&nbsp;сумку Birkin. Независимо от&nbsp;возраста, Марго как будто чувствует себя неуместной: ребенок в&nbsp;шубе выглядит так&nbsp;же странно, как и&nbsp;взрослая женщина с&nbsp;заколкой и&nbsp;в&nbsp;платье для тенниса.`,
    },

    {
        cover: CinemaArtisticExhibit2Cover.src,
        coverMedia: CinemaArtisticExhibit2CoverMedia.src,
        option: {
            title: 'GUCCI JACKIE 1961',
            year: '1961, ПЕРЕВЫПУСК — 2020',
            film: '«ДОМ GUCCI», 2021',
        },
        description1: `Jackie Bag можно назвать одной из&nbsp;самых культовых сумок за&nbsp;всю историю Gucci. Она появилась в&nbsp;ассортименте бренда в&nbsp;1950-х годах, при Альдо и&nbsp;Родольфо Гуччи, но&nbsp;тогда называлась Constance. В&nbsp;1963-м экс-первая леди США, Жаклин Кеннеди, зашла в&nbsp;бутик Gucci и&nbsp;купила сразу шесть сумок Constance. С&nbsp;тех пор Жаклин и&nbsp;сумка Gucci были неразлучны, а&nbsp;бренд увековечил их&nbsp;крепкую дружбу в&nbsp;названии Jackie. За&nbsp;60&nbsp;лет сумка неоднократно подвергалась изменениям. В&nbsp;2020 году креативный директор Gucci Алессандро Микеле перевыпустил Jackie практически в&nbsp;оригинальном виде, сделав ее&nbsp;главным объектом желания модниц всего мира.`,
        image: CinemaArtisticExhibit2Image.src,
        description2: `У&nbsp;сумки Jackie есть камео в&nbsp;фильме &laquo;Дом Gucci&raquo;. Единственный раз, когда Патриция Гуччи в&nbsp;исполнении Леди Гаги появилась на&nbsp;экране в&nbsp;total Gucci look с&nbsp;сумкой Jackie из&nbsp;архивов модного дома, относится к&nbsp;сцене, где героиня узнает, что продукция бренда активно подделывается, и&nbsp;теперь сумку Gucci может позволить себе даже ее&nbsp;прислуга.`,
    },

    {
        cover: CinemaArtisticExhibit3Cover.src,
        coverMedia: CinemaArtisticExhibit3CoverMedia.src,
        option: {
            title: 'CHANEL TIMELESS CLASSIC',
            year: '1983',
            film: '«СПЕНСЕР», 2021',
        },
        description1: `Сумку Chanel Timeless Classic Карл Лагерфельд придумал и&nbsp;показал в&nbsp;своей первой коллекции для Chanel весна-лето 1983. В&nbsp;основе дизайна&nbsp;&mdash; узнаваемая сумка-легенда 2.55, созданная самой Габриэль Шанель в&nbsp;1955-м. Четкая прямоугольная форма, ромбовидная стежка, ремень-цепочка, &laquo;СС&raquo;-застежка и&nbsp;контрастная бордовая подкладка, которая по&nbsp;задумке самой Габриэль позволит легко найти вещи в&nbsp;недрах сумки&nbsp;&mdash; из&nbsp;этих и&nbsp;состоит сумка Chanel Timeless Classiс.`,
        image: CinemaArtisticExhibit3Image.src,
        description2: `В&nbsp;драме Пабло Ларраина &laquo;Спенсер&raquo; принцесса Диана в&nbsp;исполнении Кристен Стюарт появляется с&nbsp;сумкой Chanel Timeless Classic уже в&nbsp;первые 5&nbsp;минут фильма. Художник по&nbsp;костюмам, двукратная обладательница Оскара Жаклин Дюрран проанализировала стиль Дианы периода 1982-1992 годов и&nbsp;решила, что основой ее&nbsp;гардероба станут одежда и&nbsp;аксессуары Chanel. Черная Chanel Timeless Classic действительно была одной из&nbsp;любимых сумок принцессы. &laquo;В&nbsp;Chanel она всегда была самой собой. Довольно часто Chanel возникает в&nbsp;кадре именно в&nbsp;моменты силы Дианы&raquo;,&nbsp;&mdash; объяснила Кристен Стюарт, которая с&nbsp;большим интересом принимала участие в&nbsp;работе над костюмами.`,
    },

    {
        cover: CinemaArtisticExhibit4Cover.src,
        coverMedia: CinemaArtisticExhibit4CoverMedia.src,
        option: {
            title: 'HERMÈS KELLY',
            year: '1930-Е',
            film: '«ИДЕАЛЬНОЕ УБИЙСТВО», 1998',
        },
        description1: `Героиня Гвинет Пэлтроу&nbsp;&mdash; воспитанная в&nbsp;богатстве, скучающая жена менеджера-маньяка с&nbsp;Уолл-стрит&nbsp;&mdash; олицетворение термина &laquo;тихая роскошь&raquo;. &laquo;Она элегантна, и&nbsp;ничего в&nbsp;ней не&nbsp;бросается в&nbsp;глаза, ничего не&nbsp;кричит о&nbsp;деньгах&raquo;,&nbsp;&mdash; говорила о&nbsp;персонаже художница по&nbsp;костюмам Эллен Мирожник. Хотя, конечно, сумку Herm&egrave;s Kelly, с&nbsp;которой героиня появляется на&nbsp;экране, безмолвной никак не&nbsp;назвать. Лаконичная черная сумка в&nbsp;коже Box идеально вписалась в&nbsp;образ богатой жительницы Нью-Йорка 1990-х. И&nbsp;главная &laquo;пасхалка&raquo;: этот фильм вдохновлен триллером Хичкока &laquo;В&nbsp;случае убийства набирайте &bdquo;М&ldquo;&raquo;, с&nbsp;Грейс Келли в&nbsp;главной роли.`,
        image: CinemaArtisticExhibit4Image.src,
        description2: `На&nbsp;самом деле сумка Kelly родилась в&nbsp;1930-х годах и&nbsp;тогда была известна как Sac &agrave;&nbsp;D&eacute;p&ecirc;ches, прежде чем в&nbsp;середине 1950-х годов была переименована в&nbsp;Kelly&nbsp;&mdash; в&nbsp;честь звезды Голливуда Грейс Келли. Княгиня Монако была большой поклонницей этой модели Herm&egrave;s и&nbsp;однажды прикрылась ей&nbsp;от&nbsp;папарацци, чтобы не&nbsp;афишировать свою беременность. Фото Грейс с&nbsp;Sac &agrave;&nbsp;D&eacute;p&ecirc;ches в&nbsp;руках попало на&nbsp;обложки журналов, а&nbsp;ее&nbsp;репутация иконы стиля помогла сумке моментально приобрести культовый статус.`,
    },

    {
        cover: CinemaArtisticExhibit5Cover.src,
        coverMedia: CinemaArtisticExhibit5CoverMedia.src,
        option: {
            title: 'GUCCI BAMBOO',
            year: '1947, ПЕРЕВЫПУСК — 2021',
            film: '«ФОТОУВЕЛИЧЕНИЕ», 1966',
        },
        description1: `Фильм Микеланджело Антониони &laquo;Фотоувеличение&raquo;&nbsp;&mdash; это кинопритча об&nbsp;успешном фотографе Томасе, который в&nbsp;перерыве между модными съемками и&nbsp;тусовками случайно запечатлел на&nbsp;пленку убийство в&nbsp;городском парке. Вокруг гедонизм лондонских &laquo;свингующих 60-х&raquo;, так что в&nbsp;кадре появятся такие звезды эпохи, как Верушка, Джейн Биркин и&nbsp;Ванесса Редгрейв. У&nbsp;последней в&nbsp;руках можно заметить хит тех лет&nbsp;&mdash; сумку Gucci Bamboo. Эта модель достаточно классическая, чтобы оказаться в&nbsp;гардеробе утонченной героини Джейн в&nbsp;исполнении Редгрейв, но&nbsp;и&nbsp;достаточно знаковая, чтобы художник по&nbsp;костюмам Джоселин Рикардс остановила свой выбор на&nbsp;ней.`,
        image: CinemaArtisticExhibit5Image.src,
        description2: `Сумка Gucci Bamboo, которую принято считать самой первой it-bag в&nbsp;истории, появилась в&nbsp;1947&nbsp;году. Она стала своеобразным ответом бренда кризису послевоенной Италии, когда государство занесло кожу в&nbsp;список &laquo;контролируемых товаров&raquo;. В&nbsp;целях экономии семья Гуччи экспериментировала с&nbsp;пенькой, парусиной и&nbsp;джутом, но&nbsp;именно сумка с&nbsp;ручками из&nbsp;обожженного бамбука в&nbsp;итоге принесла бренду огромный успех. Сумка символизировала возрождение Италии&nbsp;&mdash; экзотическая бамбуковая деталь словно давала людям надежду на&nbsp;новые путешествия в&nbsp;дальние страны.`,
    },
];

const CinemaArtistic: React.FC = () => {
    const isMobile = useMediaQuery(`(max-width: ${MEDIA_SIZES.mobile})`);

    const onSubmitSubscribeForm = (data: any) => {
        sendMindbox('RegistraciyaSAukcionaXudozhestvennyj', {
            customer: {
                email: data.email,
                subscriptions: [
                    {
                        pointOfContact: 'email',
                        isSubscribed: true,
                    },
                ],
            },
        });
    };

    return (
        <>
            <section className="cinema-artistic-main">
                <div className="cinema-artistic-main-text">
                    <div className="cinema-artistic-main-text-title-media">
                        <svg viewBox="0 0 353 148" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M26.571 65.3896C26.571 68.6938 24.8377 71.2938 21.8585 72.8646C26.1377 74.3813 28.521 77.523 28.521 81.6938C28.521 88.573 23.646 92.8521 16.0085 92.8521H0.137695V54.8271H14.9794C22.0752 54.8271 26.571 58.8896 26.571 65.3896ZM15.6835 76.3313H7.88353V86.7313H15.6835C18.7169 86.7313 20.6669 84.7272 20.6669 81.5313C20.6669 78.3355 18.7169 76.3313 15.6835 76.3313ZM7.88353 60.8938V70.2646H13.7335C16.7127 70.2646 18.6627 68.423 18.6627 65.5521C18.6627 62.6813 17.0919 60.8938 14.6544 60.8938H7.88353Z"
                                fill="white"
                            />
                            <path
                                d="M64.9871 92.8521V54.8271H72.7329V69.2896L85.6245 54.8271H94.562L80.5329 70.4813L94.8329 92.8521H85.787L75.2245 76.3855L72.7329 79.2021V92.8521H64.9871Z"
                                fill="white"
                            />
                            <path
                                d="M106.674 83.6438L107.27 82.1813L94.9201 54.9355H103.641L111.116 72.973L118.591 54.9355H127.203L114.203 84.2396C111.224 90.6313 108.678 93.3938 104.128 93.3938C101.528 93.3938 99.0367 93.123 97.2492 92.5813V86.0272C99.5242 86.7313 101.474 87.1105 102.666 87.1105C104.183 87.1105 105.753 85.8646 106.674 83.6438Z"
                                fill="white"
                            />
                            <path
                                d="M133.357 82.6688L135.686 54.9355H158.491V92.8521H150.745V61.0022H142.891L141.103 83.3188C140.616 88.7897 137.853 92.8521 132.166 92.8521H126.424V86.7855H130.92C132.382 86.7855 133.086 85.7021 133.357 82.6688Z"
                                fill="white"
                            />
                            <path
                                d="M170.819 68.3688H177.319C194.815 68.3688 194.815 92.9605 177.319 92.9605H163.074V54.9355H170.819V68.3688ZM176.994 74.4355H170.819V86.8938H176.994C185.174 86.8938 185.119 74.4355 176.994 74.4355Z"
                                fill="white"
                            />
                            <path
                                d="M204.598 92.8521V60.8396H193.548V54.8271H223.448V60.8396H212.398V92.8521H204.598Z"
                                fill="white"
                            />
                            <path
                                d="M240.977 93.2855C231.66 93.2855 225.052 85.2688 225.052 73.8397C225.052 62.4105 231.66 54.3938 240.977 54.3938C250.294 54.3938 256.902 62.4105 256.902 73.8397C256.902 85.2688 250.294 93.2855 240.977 93.2855ZM240.977 87.0563C245.635 87.0563 248.994 81.6396 248.994 73.8938C248.994 66.0938 245.635 60.623 240.977 60.623C236.265 60.623 232.906 66.0938 232.906 73.8938C232.906 81.6396 236.265 87.0563 240.977 87.0563Z"
                                fill="white"
                            />
                            <path
                                d="M286.402 65.3896C286.402 68.6938 284.668 71.2938 281.689 72.8646C285.968 74.3813 288.352 77.523 288.352 81.6938C288.352 88.573 283.477 92.8521 275.839 92.8521H259.968V54.8271H274.81C281.906 54.8271 286.402 58.8896 286.402 65.3896ZM275.514 76.3313H267.714V86.7313H275.514C278.548 86.7313 280.498 84.7272 280.498 81.5313C280.498 78.3355 278.548 76.3313 275.514 76.3313ZM267.714 60.8938V70.2646H273.564C276.543 70.2646 278.493 68.423 278.493 65.5521C278.493 62.6813 276.923 60.8938 274.485 60.8938H267.714Z"
                                fill="white"
                            />
                            <path
                                d="M305.935 93.2855C296.618 93.2855 290.01 85.2688 290.01 73.8397C290.01 62.4105 296.618 54.3938 305.935 54.3938C315.251 54.3938 321.86 62.4105 321.86 73.8397C321.86 85.2688 315.251 93.2855 305.935 93.2855ZM305.935 87.0563C310.593 87.0563 313.951 81.6396 313.951 73.8938C313.951 66.0938 310.593 60.623 305.935 60.623C301.222 60.623 297.864 66.0938 297.864 73.8938C297.864 81.6396 301.222 87.0563 305.935 87.0563Z"
                                fill="white"
                            />
                            <path
                                d="M323.951 92.8521V54.8271H332.618L338.414 73.948L344.209 54.8271H352.876V92.8521H345.997V64.9021L340.959 81.8021H335.868L330.776 64.7938V92.8521H323.951Z"
                                fill="white"
                            />
                            <path
                                d="M3.65436 38.8521V0.827148H11.4002V15.2896L24.2919 0.827148H33.2294L19.2002 16.4813L33.5002 38.8521H24.4544L13.8919 22.3855L11.4002 25.2022V38.8521H3.65436Z"
                                fill="white"
                            />
                            <path
                                d="M34.3999 38.8521L46.2082 0.827148H53.2499L65.0582 38.8521H57.854L55.6332 31.4313H43.8249L41.604 38.8521H34.3999ZM45.6124 25.3646H53.8457L49.729 11.7146L45.6124 25.3646Z"
                                fill="white"
                            />
                            <path
                                d="M68.6121 38.8521V0.827148H76.3579V15.2896L89.2495 0.827148H98.187L84.1579 16.4813L98.4579 38.8521H89.412L78.8495 22.3855L76.3579 25.2022V38.8521H68.6121Z"
                                fill="white"
                            />
                            <path
                                d="M226.029 146.852V108.827H233.775V123.29L246.667 108.827H255.604L241.575 124.481L255.875 146.852H246.829L236.267 130.385L233.775 133.202V146.852H226.029Z"
                                fill="white"
                            />
                            <path
                                d="M279.525 108.827H286.404V146.852H278.658V122.315L264.629 146.852H257.75V108.827H265.496V133.365L279.525 108.827Z"
                                fill="white"
                            />
                            <path
                                d="M290.229 146.852V108.827H297.975V124.59H311.137V108.827H318.883V146.852H311.137V130.656H297.975V146.852H290.229Z"
                                fill="white"
                            />
                            <path
                                d="M337.062 147.285C327.745 147.285 321.137 139.269 321.137 127.84C321.137 116.41 327.745 108.394 337.062 108.394C346.378 108.394 352.987 116.41 352.987 127.84C352.987 139.269 346.378 147.285 337.062 147.285ZM337.062 141.056C341.72 141.056 345.078 135.64 345.078 127.894C345.078 120.094 341.72 114.623 337.062 114.623C332.349 114.623 328.991 120.094 328.991 127.894C328.991 135.64 332.349 141.056 337.062 141.056Z"
                                fill="white"
                            />
                            <path
                                d="M8.6792 122.122C7.8572 122.122 7.1102 121.924 6.4382 121.528C5.7722 121.132 5.2412 120.592 4.8452 119.908C4.4552 119.218 4.2602 118.441 4.2602 117.577V113.266C4.2602 112.36 4.4552 111.559 4.8452 110.863C5.2412 110.161 5.7812 109.615 6.4652 109.225C7.1552 108.829 7.9412 108.631 8.8232 108.631C9.5372 108.631 10.2002 108.778 10.8122 109.072C11.4302 109.36 11.9492 109.777 12.3692 110.323L11.1722 111.385C10.9142 111.007 10.5782 110.707 10.1642 110.485C9.7502 110.263 9.3032 110.152 8.8232 110.152C8.2532 110.152 7.7462 110.29 7.3022 110.566C6.8642 110.836 6.5192 111.196 6.2672 111.646C6.0152 112.09 5.88919 112.57 5.88919 113.086V115.687L5.5382 115.291C5.9162 114.751 6.3962 114.319 6.9782 113.995C7.5602 113.671 8.1902 113.509 8.8682 113.509C9.6722 113.509 10.3922 113.698 11.0282 114.076C11.6702 114.454 12.1742 114.967 12.5402 115.615C12.9122 116.257 13.0982 116.98 13.0982 117.784C13.0982 118.588 12.8972 119.317 12.4952 119.971C12.0932 120.625 11.5562 121.147 10.8842 121.537C10.2182 121.927 9.4832 122.122 8.6792 122.122ZM8.6792 120.574C9.1952 120.574 9.6662 120.451 10.0922 120.205C10.5182 119.953 10.8542 119.617 11.1002 119.197C11.3522 118.771 11.4782 118.3 11.4782 117.784C11.4782 117.268 11.3522 116.797 11.1002 116.371C10.8542 115.945 10.5182 115.609 10.0922 115.363C9.6722 115.111 9.2042 114.985 8.6882 114.985C8.1722 114.985 7.7012 115.111 7.2752 115.363C6.8552 115.609 6.5192 115.945 6.2672 116.371C6.0152 116.797 5.88919 117.268 5.88919 117.784C5.88919 118.294 6.0122 118.762 6.2582 119.188C6.5102 119.608 6.8462 119.944 7.2662 120.196C7.6922 120.448 8.1632 120.574 8.6792 120.574Z"
                                fill="white"
                            />
                            <path d="M18.5034 116.839V115.516H23.9034V116.839H18.5034Z" fill="white" />
                            <path
                                d="M29.1255 121.843L29.1345 120.403L34.8855 115.228C35.3655 114.796 35.6865 114.388 35.8485 114.004C36.0165 113.614 36.1005 113.215 36.1005 112.807C36.1005 112.309 35.9865 111.859 35.7585 111.457C35.5305 111.055 35.2185 110.737 34.8225 110.503C34.4325 110.269 33.9885 110.152 33.4905 110.152C32.9745 110.152 32.5155 110.275 32.1135 110.521C31.7115 110.761 31.3935 111.082 31.1595 111.484C30.9315 111.886 30.8205 112.324 30.8265 112.798H29.1885C29.1885 111.982 29.3775 111.262 29.7555 110.638C30.1335 110.008 30.6465 109.516 31.2945 109.162C31.9485 108.802 32.6895 108.622 33.5175 108.622C34.3215 108.622 35.0415 108.808 35.6775 109.18C36.3135 109.546 36.8145 110.047 37.1805 110.683C37.5525 111.313 37.7385 112.027 37.7385 112.825C37.7385 113.389 37.6665 113.878 37.5225 114.292C37.3845 114.706 37.1685 115.09 36.8745 115.444C36.5805 115.792 36.2115 116.164 35.7675 116.56L30.9885 120.853L30.7815 120.313H37.7385V121.843H29.1255Z"
                                fill="white"
                            />
                            <path
                                d="M40.3958 121.852L45.0578 110.431H39.1718V108.892H46.7768V110.431L42.1238 121.852H40.3958Z"
                                fill="white"
                            />
                            <path
                                d="M51.2838 121.852L55.6218 108.892H57.8538L62.1918 121.852H60.5268L56.4678 109.828H56.9718L52.9488 121.852H51.2838ZM53.3718 118.819V117.316H60.1038V118.819H53.3718Z"
                                fill="white"
                            />
                            <path
                                d="M63.6229 121.852V108.892H68.6719C69.4459 108.892 70.1059 109.051 70.6519 109.369C71.2039 109.687 71.6239 110.107 71.9119 110.629C72.2059 111.145 72.3529 111.703 72.3529 112.303C72.3529 113.005 72.1729 113.62 71.8129 114.148C71.4529 114.676 70.9669 115.039 70.3549 115.237L70.3369 114.796C71.1709 115.018 71.8189 115.426 72.2809 116.02C72.7429 116.614 72.9739 117.322 72.9739 118.144C72.9739 118.9 72.8179 119.554 72.5059 120.106C72.1999 120.658 71.7559 121.087 71.1739 121.393C70.5979 121.699 69.9139 121.852 69.1219 121.852H63.6229ZM65.2429 120.322H68.8159C69.2959 120.322 69.7249 120.235 70.1029 120.061C70.4809 119.881 70.7779 119.629 70.9939 119.305C71.2159 118.981 71.3269 118.591 71.3269 118.135C71.3269 117.697 71.2279 117.304 71.0299 116.956C70.8379 116.608 70.5649 116.332 70.2109 116.128C69.8629 115.918 69.4579 115.813 68.9959 115.813H65.2429V120.322ZM65.2429 114.301H68.6539C69.0379 114.301 69.3829 114.22 69.6889 114.058C70.0009 113.89 70.2469 113.656 70.4269 113.356C70.6129 113.056 70.7059 112.705 70.7059 112.303C70.7059 111.745 70.5169 111.289 70.1389 110.935C69.7609 110.581 69.2659 110.404 68.6539 110.404H65.2429V114.301Z"
                                fill="white"
                            />
                            <path d="M74.5875 121.852V108.892H82.7775V110.413H76.1895V121.852H74.5875Z" fill="white" />
                            <path
                                d="M86.0653 121.852L87.6133 118.639L83.0503 108.892H84.8413L88.4503 116.929L92.1403 108.892H93.8503L87.8023 121.852H86.0653Z"
                                fill="white"
                            />
                            <path
                                d="M99.7703 122.122C98.4803 122.122 97.3853 121.837 96.4853 121.267C95.5853 120.697 94.8983 119.905 94.4243 118.891C93.9563 117.877 93.7223 116.704 93.7223 115.372C93.7223 114.04 93.9563 112.867 94.4243 111.853C94.8983 110.839 95.5853 110.047 96.4853 109.477C97.3853 108.907 98.4803 108.622 99.7703 108.622C101.27 108.622 102.503 109.003 103.469 109.765C104.441 110.527 105.11 111.553 105.476 112.843L103.847 113.275C103.583 112.309 103.112 111.547 102.434 110.989C101.756 110.431 100.868 110.152 99.7703 110.152C98.8043 110.152 98.0003 110.371 97.3583 110.809C96.7163 111.247 96.2333 111.859 95.9093 112.645C95.5853 113.425 95.4203 114.334 95.4143 115.372C95.4083 116.404 95.5673 117.313 95.8913 118.099C96.2153 118.879 96.7013 119.491 97.3493 119.935C97.9973 120.373 98.8043 120.592 99.7703 120.592C100.868 120.592 101.756 120.313 102.434 119.755C103.112 119.191 103.583 118.429 103.847 117.469L105.476 117.901C105.11 119.185 104.441 120.211 103.469 120.979C102.503 121.741 101.27 122.122 99.7703 122.122Z"
                                fill="white"
                            />
                            <path
                                d="M110.609 121.852V110.413H106.19V108.892H116.63V110.413H112.211V121.852H110.609Z"
                                fill="white"
                            />
                            <path
                                d="M116.632 121.852L120.97 108.892H123.202L127.54 121.852H125.875L121.816 109.828H122.32L118.297 121.852H116.632ZM118.72 118.819V117.316H125.452V118.819H118.72Z"
                                fill="white"
                            />
                        </svg>
                    </div>

                    <h1 className="cinema-artistic-main-text__title">КАК В КУЛЬТОВОМ КИНО</h1>

                    <p className="cinema-artistic-main-text__subtitle">6 - 27 АВГУСТА</p>
                </div>

                <div className="cinema-artistic-main-logos">
                    <svg viewBox="0 0 908 59" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M290.396 40.4886L284.894 34.969L279.392 40.4886L277.275 38.3646L282.777 32.8449L277.289 27.3397L279.406 25.2157L284.894 30.7209L290.381 25.2157L292.499 27.3397L287.011 32.8449L292.513 38.3646L290.396 40.4886Z"
                            fill="white"
                        />
                        <path
                            d="M627.827 40.4886L622.325 34.969L616.823 40.4886L614.705 38.3646L620.207 32.8449L614.72 27.3397L616.837 25.2157L622.325 30.7209L627.812 25.2157L629.929 27.3397L624.442 32.8449L629.944 38.3646L627.827 40.4886Z"
                            fill="white"
                        />
                        <g clipPath="url(#clip0_439_1298)">
                            <path
                                d="M394.81 24.2954C394.882 23.6571 393.95 22.4841 393.306 21.666L385.745 11.9663V21.666C385.745 22.5186 386.068 23.7976 386.319 24.2954V24.4729H383.023V24.2954C383.274 23.7976 383.597 22.5186 383.597 21.666V3.1216C383.597 2.26893 383.274 0.989925 383.023 0.492152V0.314705H386.319V0.492152C386.068 0.989925 385.745 2.26893 385.745 3.1216V10.7956L393.985 2.3058C394.45 1.80803 394.81 0.883918 394.989 0.317009H397.104V0.459889L387.179 10.5145L398.074 24.3V24.4775H394.813V24.3L394.81 24.2954ZM399.22 0.492152V0.314705H402.481V0.492152C402.23 0.989925 401.907 2.26893 401.907 3.1216V22.1637L411.474 0.314705H414.161V0.492152C413.91 0.989925 413.587 2.26893 413.587 3.1216V21.6683C413.587 22.5209 413.91 23.7999 414.161 24.2977V24.4752H410.9V24.2977C411.151 23.7999 411.474 22.5209 411.474 21.6683V2.51781L401.907 24.4729H399.22V24.2954C399.471 23.7976 399.794 22.5186 399.794 21.666V3.1216C399.794 2.26893 399.471 0.989925 399.22 0.492152ZM416.455 0.492152V0.314705H419.752V0.492152C419.5 0.989925 419.177 2.26893 419.177 3.1216V10.9016H428.494V3.1216C428.494 2.26893 428.171 0.989925 427.92 0.492152V0.314705H431.216V0.492152C430.965 0.989925 430.642 2.26893 430.642 3.1216V21.6683C430.642 22.5209 430.965 23.7999 431.216 24.2977V24.4752H427.92V24.2977C428.171 23.7999 428.494 22.5209 428.494 21.6683V11.6483H419.177V21.666C419.177 22.5186 419.5 23.7976 419.752 24.2954V24.4729H416.455V24.2954C416.706 23.7976 417.03 22.5186 417.03 21.666V3.1216C417.03 2.26893 416.706 0.989925 416.455 0.492152ZM433.047 12.607C433.047 6.85259 435.593 0.03125 440.823 0.03125C446.053 0.03125 448.598 6.85259 448.598 12.607C448.598 19.214 445.481 24.7563 440.823 24.7563C436.164 24.7563 433.047 19.214 433.047 12.607ZM446.199 12.607C446.199 7.09918 445.16 0.812478 440.825 0.812478C436.49 0.812478 435.451 7.10148 435.451 12.607C435.451 18.6816 436.92 23.9751 440.825 23.9751C444.73 23.9751 446.199 18.6816 446.199 12.607ZM463.723 0.314705L464.476 2.97872H464.262C463.546 2.3035 461.073 1.09593 460.285 1.09593H457.491V21.6683C457.491 22.5209 457.814 23.7999 458.065 24.2977V24.4752H454.769V24.2977C455.02 23.7999 455.343 22.5209 455.343 21.6683V1.09593H452.584C451.759 1.09593 449 2.48094 448.391 2.97872H448.175L449.07 0.314705H463.725H463.723ZM477.126 21.8434H477.342L476.589 24.4729H465.803V24.2954C466.054 23.7976 466.378 22.5186 466.378 21.666V3.1216C466.378 2.26893 466.054 0.989925 465.803 0.492152V0.314705H476.268L477.021 2.94415H476.807C476.091 2.26893 473.904 1.06137 472.83 1.06137H468.53V10.9385H475.661V11.6851H468.53V23.7285H473.153C474.227 23.7285 476.415 22.5209 477.13 21.8457L477.126 21.8434ZM480.531 24.4729H478.346L478.311 24.2954L486.049 0.03125H487.518L496.37 24.2954V24.4729H493.146V24.2954C493.325 23.5856 493.146 21.8089 492.644 20.387L490.422 14.3469H482.502L480.854 19.6403C480.138 21.9149 480.173 23.2999 480.531 24.2954V24.4729ZM490.136 13.5656L486.121 2.58695L482.716 13.5656H490.133H490.136ZM509.092 0.314705L509.845 2.97872H509.631C508.915 2.3035 506.442 1.09593 505.654 1.09593H502.86V21.6683C502.86 22.5209 503.183 23.7999 503.434 24.2977V24.4752H500.138V24.2977C500.389 23.7999 500.712 22.5209 500.712 21.6683V1.09593H497.953C497.128 1.09593 494.369 2.48094 493.76 2.97872H493.546L494.441 0.314705H509.096H509.092ZM511.172 0.492152V0.314705C511.816 0.349272 512.964 0.386144 513.717 0.386144C514.47 0.386144 515.974 0.314705 517.622 0.314705C521.565 0.314705 524.431 2.48094 524.431 5.99993C524.431 9.90837 521.565 12.1115 516.081 12.1115H513.896V21.7028C513.896 22.5555 514.219 23.7999 514.47 24.2954V24.4729H511.174V24.2954C511.425 23.7976 511.748 22.5186 511.748 21.666V3.1216C511.748 2.26893 511.425 0.989925 511.174 0.492152H511.172ZM513.896 1.09593V11.3648H516.081C520.309 11.3648 521.995 9.4106 521.995 6.21425C521.995 3.01789 520.061 1.09824 516.906 1.09824H513.896V1.09593Z"
                                fill="white"
                            />
                            <path
                                d="M350.936 54.9244V54.747C350.936 54.0372 350.578 52.4033 349.681 50.8385L345.453 43.3788L341.617 50.0942C340.292 52.3687 340.362 53.7537 340.613 54.7493V54.9267H338.035L338 54.7493L344.953 42.457L338.324 30.7662H341.799V30.9437C341.727 31.6535 342.122 33.3588 342.982 34.8521L346.422 40.8923L349.504 35.5988C350.794 33.3611 350.794 31.9392 350.543 30.9437V30.7662H353.337L353.265 30.9437L346.922 41.7795L354.411 54.9244H350.936ZM356.027 52.0115C356.027 51.4423 356.133 50.9099 356.278 50.4122H357.245C357.1 50.8731 356.994 51.3708 356.994 52.0115C356.994 53.0762 357.458 54.0003 358.463 54.0003C360.29 54.0003 361.187 51.7257 362.261 48.8497L362.368 48.5294L354.95 30.7662H358.139V30.9437C357.96 31.6535 358.284 33.3957 358.893 34.8521L363.407 45.7939L367.312 35.5988C368.244 33.1122 368.065 31.9392 367.814 30.9437V30.7662H370.108L370.143 30.9437L363.118 49.2046C361.794 52.6867 360.861 54.9244 358.423 54.9244C356.703 54.9244 356.022 53.6454 356.022 52.0115H356.027ZM368.534 54.1432C371.008 53.3251 372.549 47.1444 372.8 40.1802L373.051 33.5017C373.086 32.649 372.586 31.37 371.582 30.9437V30.7662H382.941V30.9437C382.69 31.4415 382.367 32.7205 382.367 33.5731V52.1175C382.367 52.7213 382.546 53.5394 382.725 54.1432H384.373L385.126 58.584H384.912C383.801 56.7357 382.297 54.9244 380.898 54.9244H370.829C370.003 54.9244 368.321 56.6643 367.065 58.584H366.852L367.746 54.1432H368.534ZM370.289 54.1432H380.215V31.5129H374.16L373.764 40.2516C373.478 46.5406 372.402 52.0461 370.289 54.1432ZM386.058 43.0585C386.058 37.3041 388.604 30.4828 393.834 30.4828C399.064 30.4828 401.609 37.3041 401.609 43.0585C401.609 49.6655 398.492 55.2079 393.834 55.2079C389.175 55.2079 386.058 49.6655 386.058 43.0585ZM399.21 43.0585C399.21 37.5507 398.171 31.264 393.836 31.264C389.501 31.264 388.462 37.553 388.462 43.0585C388.462 49.1332 389.931 54.4266 393.836 54.4266C397.741 54.4266 399.21 49.1332 399.21 43.0585ZM401.576 54.747L409.352 39.5764L402.292 30.9068V30.7639H404.549C404.549 31.3332 404.728 32.3978 405.158 32.9302L412.362 41.8832V33.5708C412.362 32.7182 412.039 31.4392 411.788 30.9414V30.7639H415.049V30.9414C414.798 31.4392 414.475 32.7182 414.475 33.5708V41.9201L421.678 32.9325C422.108 32.4001 422.287 31.3331 422.287 30.7662H424.544V30.9091L417.485 39.5787L425.26 54.7493V54.9267H422.357V54.7493C422.536 54.1109 421.962 53.0439 421.497 52.1198L416.086 41.284L414.472 43.3097V52.1198C414.472 52.9725 414.796 54.2515 415.047 54.7493V54.9267H411.785V54.7493C412.036 54.2515 412.359 52.9725 412.359 52.1198V43.3097L410.711 41.284L405.3 52.1198C404.835 53.0439 404.261 54.1086 404.44 54.7493V54.9267H401.574V54.7493L401.576 54.747ZM437.698 52.295H437.912L437.159 54.9244H426.374V54.747C426.625 54.2492 426.948 52.9702 426.948 52.1175V33.5731C426.948 32.7205 426.625 31.4415 426.374 30.9437V30.7662H436.838L437.591 33.3957H437.377C436.662 32.7205 434.474 31.5129 433.4 31.5129H429.1V41.39H436.232V42.1367H429.1V54.18H433.723C434.797 54.18 436.985 52.9725 437.701 52.2973L437.698 52.295ZM451.28 31.7595C451.531 31.7595 451.782 31.688 451.961 31.582H452.175V35.9883H451.638C451.459 33.0385 449.846 31.2986 447.159 31.2986C443.182 31.2986 441.496 36.9469 441.496 42.6667C441.496 48.3865 442.642 54.3552 446.836 54.3552C449.523 54.3552 451.029 52.0115 451.638 48.2436H452.498C451.889 52.2235 450.276 55.2079 446.836 55.2079C441.641 55.2079 439.095 48.9189 439.095 42.6667C439.095 36.4146 442.319 30.4805 447.122 30.4805C449.809 30.4805 450.418 31.7595 451.278 31.7595H451.28ZM469.199 30.7639L469.952 33.4279H469.736C469.02 32.7527 466.547 31.5452 465.759 31.5452H462.965V52.1152C462.965 52.9679 463.288 54.2469 463.539 54.7446V54.9221H460.243V54.7446C460.494 54.2469 460.817 52.9679 460.817 52.1152V31.5452H458.058C457.233 31.5452 454.474 32.9302 453.865 33.4279H453.649L454.544 30.7639H469.199ZM471.28 30.9414V30.7639C471.923 30.7985 473.072 30.8354 473.825 30.8354C474.578 30.8354 475.043 30.7639 476.691 30.7639C480.633 30.7639 483.536 32.9302 483.536 36.2003C483.536 39.4704 481.493 41.0328 479.308 41.8486C482.462 42.3464 484.971 44.5126 484.971 47.7113C484.971 50.9099 483.106 54.9244 477.23 54.9244H471.282V54.747C471.533 54.2492 471.856 52.9702 471.856 52.1175V33.5731C471.856 32.7205 471.533 31.4415 471.282 30.9437L471.28 30.9414ZM474.004 41.7057H476.405C479.701 41.7057 481.063 39.8575 481.063 36.1634C481.063 33.4279 479.845 31.5452 475.975 31.5452H474.004V41.7057ZM477.767 42.4524H474.004V52.1521C474.004 52.7559 474.183 53.574 474.362 54.1777H477.121C481.17 54.1777 482.495 51.122 482.495 47.9256C482.495 44.7293 480.919 42.4547 477.765 42.4547L477.767 42.4524ZM497.978 52.2927H498.194L497.441 54.9221H486.656V54.7446C486.907 54.2469 487.23 52.9679 487.23 52.1152V33.5708C487.23 32.7182 486.907 31.4392 486.656 30.9414V30.7639H497.12L497.873 33.3934H497.66C496.944 32.7182 494.756 31.5106 493.683 31.5106H489.382V41.3877H496.514V42.1344H489.382V54.1777H494.006C495.08 54.1777 497.267 52.9702 497.983 52.295L497.978 52.2927ZM499.986 30.9414V30.7639H503.282V30.9414C503.031 31.4392 502.708 32.7182 502.708 33.5708V41.3508H512.025V33.5708C512.025 32.7182 511.702 31.4392 511.451 30.9414V30.7639H514.747V30.9414C514.496 31.4392 514.173 32.7182 514.173 33.5708V52.1152C514.173 52.9679 514.496 54.2469 514.747 54.7446V54.9221H511.451V54.7446C511.702 54.2469 512.025 52.9679 512.025 52.1152V42.0975H502.708V52.1152C502.708 52.9679 503.031 54.2469 503.282 54.7446V54.9221H499.986V54.7446C500.237 54.2469 500.561 52.9679 500.561 52.1152V33.5708C500.561 32.7182 500.237 31.4392 499.986 30.9414ZM517.008 30.9414V30.7639H520.304V30.9414C520.053 31.4392 519.73 32.7182 519.73 33.5708V41.3508H529.047V33.5708C529.047 32.7182 528.724 31.4392 528.472 30.9414V30.7639H531.769V30.9414C531.518 31.4392 531.194 32.7182 531.194 33.5708V52.1152C531.194 52.9679 531.518 54.2469 531.769 54.7446V54.9221H528.472V54.7446C528.724 54.2469 529.047 52.9679 529.047 52.1152V42.0975H519.73V52.1152C519.73 52.9679 520.053 54.2469 520.304 54.7446V54.9221H517.008V54.7446C517.259 54.2469 517.582 52.9679 517.582 52.1152V33.5708C517.582 32.7182 517.259 31.4392 517.008 30.9414ZM547.182 47.603C547.182 50.9076 544.781 54.9221 539.442 54.9221H534.03V54.7446C534.281 54.2469 534.604 52.9679 534.604 52.1152V33.5708C534.604 32.7182 534.281 31.4392 534.03 30.9414V30.7639H537.326V30.9414C537.075 31.4392 536.752 32.6813 536.752 33.534V40.9936H539.476C544.781 40.9936 547.18 44.2983 547.18 47.6007L547.182 47.603ZM539.335 54.1409C543.419 54.1409 544.709 50.8016 544.709 47.5684C544.709 44.3352 543.275 41.7426 539.191 41.7426H536.754V54.1409H539.335ZM548.688 30.9414V30.7639H551.984V30.9414C551.733 31.4392 551.41 32.7182 551.41 33.5708V52.1152C551.41 52.9679 551.733 54.2469 551.984 54.7446V54.9221H548.688V54.7446C548.939 54.2469 549.262 52.9679 549.262 52.1152V33.5708C549.262 32.7182 548.939 31.4392 548.688 30.9414ZM554.278 30.9414V30.7639H557.54V30.9414C557.289 31.4392 556.966 32.7182 556.966 33.5708V52.613L566.533 30.7639H569.22V30.9414C568.969 31.4392 568.646 32.7182 568.646 33.5708V52.1152C568.646 52.9679 568.969 54.2469 569.22 54.7446V54.9221H565.959V54.7446C566.21 54.2469 566.533 52.9679 566.533 52.1152V32.967L556.966 54.9221H554.278V54.7446C554.53 54.2469 554.853 52.9679 554.853 52.1152V33.5708C554.853 32.7182 554.53 31.4392 554.278 30.9414ZM558.614 27.6367H560.19C560.19 28.9872 560.905 29.6255 561.982 29.6255C563.058 29.6255 563.774 28.9872 563.774 27.6367H565.35C565.35 29.3766 563.953 30.2293 562.017 30.2293C560.08 30.2293 558.611 29.3766 558.611 27.6367H558.614Z"
                                fill="white"
                            />
                        </g>
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M0.569336 31.9986V28.2114H15.0331V31.9986H9.54016V46.9338H4.6226V31.9986H0.569336ZM17.6765 46.8781V28.332H22.594V35.8881H30.5217V28.332H35.3499V46.8781H30.5217V38.9963H22.594V46.8781H17.6765ZM38.9561 46.7969V28.2114H54.0962V32.132H43.7545V35.6413H51.5033V39.1507H43.7545V43.3454H54.5731V46.7969H38.9561Z"
                            fill="white"
                        />
                        <path
                            d="M76.5958 47.1908C72.8646 47.1908 69.643 46.444 66.9309 44.9502C64.2361 43.4565 62.1546 41.3668 60.6863 38.6813C59.2353 35.9958 58.5098 32.8732 58.5098 29.3137C58.5098 25.7541 59.2353 22.6316 60.6863 19.946C62.1546 17.2605 64.2361 15.1709 66.9309 13.6771C69.643 12.1834 72.8646 11.4365 76.5958 11.4365C80.8798 11.4365 84.4728 12.4138 87.3749 14.3684C90.2942 16.3229 92.3498 18.9688 93.5417 22.3058L86.4421 24.1174C85.7511 22.0357 84.5851 20.4228 82.944 19.2786C81.303 18.1186 79.1869 17.5386 76.5958 17.5386C74.2292 17.5386 72.2513 18.0233 70.6621 18.9926C69.0902 19.9619 67.9069 21.3285 67.1123 23.0924C66.3177 24.8563 65.9204 26.9301 65.9204 29.3137C65.9204 31.6973 66.3177 33.771 67.1123 35.5349C67.9069 37.2988 69.0902 38.6654 70.6621 39.6348C72.2513 40.6041 74.2292 41.0888 76.5958 41.0888C79.1869 41.0888 81.303 40.5087 82.944 39.3487C84.5851 38.1887 85.7511 36.5758 86.4421 34.51L93.5417 36.3215C92.3498 39.6586 90.2942 42.3044 87.3749 44.259C84.4728 46.2135 80.8798 47.1908 76.5958 47.1908Z"
                            fill="white"
                        />
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M66.3168 45.8845L66.3154 45.8837C63.4202 44.2789 61.1863 42.0311 59.621 39.1682L59.6198 39.1659L59.6185 39.1635C58.0716 36.3005 57.3174 33.0053 57.3174 29.3078C57.3174 25.6103 58.0716 22.3151 59.6185 19.4521L59.6198 19.4497L59.621 19.4474C61.1863 16.5845 63.4202 14.3368 66.3154 12.7319L66.3168 12.7311L66.3183 12.7303C69.2464 11.1176 72.6879 10.334 76.5955 10.334C81.0823 10.334 84.9345 11.3604 88.0774 13.4767C91.2103 15.5746 93.409 18.4158 94.674 21.9576L95.064 23.0495L85.6409 25.4539L85.3016 24.4318C84.6726 22.5366 83.6361 21.1315 82.2237 20.1468L82.2206 20.1446L82.2174 20.1423C80.8324 19.1633 78.9913 18.6294 76.5955 18.6294C74.4079 18.6294 72.6742 19.0759 71.3231 19.8993C69.9665 20.7365 68.9266 21.9232 68.2134 23.5064C67.4916 25.1086 67.1123 27.0337 67.1123 29.3078C67.1123 31.5819 67.4916 33.507 68.2134 35.1092C68.9265 36.6924 69.9664 37.879 71.3229 38.7162C72.6741 39.5397 74.4078 39.9862 76.5955 39.9862C78.9913 39.9862 80.8324 39.4523 82.2174 38.4733C83.6366 37.4701 84.6739 36.0606 85.3024 34.1816L85.6433 33.1623L95.064 35.5661L94.674 36.658C93.409 40.1998 91.2103 43.0411 88.0774 45.139C84.9345 47.2552 81.0823 48.2816 76.5955 48.2816C72.6879 48.2816 69.2464 47.498 66.3183 45.8853L66.3168 45.8845Z"
                            fill="white"
                        />
                        <path
                            d="M117.729 47.1911C114.723 47.1911 112.08 46.6349 109.8 45.5225C107.52 44.3943 105.741 42.8132 104.462 40.7791C103.184 38.7451 102.545 36.3535 102.545 33.6044V12.1995L109.696 12.1519V33.5568C109.696 34.685 109.904 35.71 110.318 36.6316C110.733 37.5533 111.303 38.3478 112.028 39.0153C112.771 39.6827 113.626 40.1991 114.594 40.5646C115.578 40.9142 116.623 41.089 117.729 41.089C118.869 41.089 119.923 40.9063 120.89 40.5408C121.875 40.1753 122.73 39.6588 123.455 38.9914C124.181 38.324 124.742 37.5295 125.139 36.6078C125.554 35.6861 125.761 34.6691 125.761 33.5568V12.1519H132.913V33.6044C132.913 36.3535 132.274 38.7451 130.995 40.7791C129.717 42.8132 127.938 44.3943 125.658 45.5225C123.378 46.6349 120.735 47.1911 117.729 47.1911Z"
                            fill="white"
                        />
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M109.239 46.4817L109.236 46.4802C106.764 45.257 104.822 43.5326 103.431 41.3199C102.031 39.0925 101.354 36.505 101.354 33.5963V11.1026L110.889 11.0391V33.5486C110.889 34.5518 111.073 35.4318 111.421 36.2042C111.778 36.9982 112.261 37.6683 112.867 38.2271C113.496 38.7906 114.216 39.2263 115.036 39.5376C115.873 39.8335 116.768 39.9842 117.73 39.9842C118.728 39.9842 119.627 39.8247 120.438 39.5182L120.441 39.5169L120.445 39.5156C121.286 39.2033 122.005 38.7673 122.613 38.2078C123.218 37.6515 123.692 36.9851 124.032 36.1954L124.035 36.1878L124.039 36.1803C124.387 35.4061 124.57 34.5337 124.57 33.5486V11.047H134.106V33.5963C134.106 36.505 133.428 39.0925 132.028 41.3199C130.638 43.5326 128.695 45.257 126.223 46.4802L126.22 46.4817L126.217 46.4832C123.738 47.6924 120.898 48.2796 117.73 48.2796C114.561 48.2796 111.721 47.6924 109.242 46.4832L109.239 46.4817Z"
                            fill="white"
                        />
                        <path d="M143.597 46.476V12.1519H150.645V40.4216H166.709V46.476H143.597Z" fill="white" />
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M142.404 47.5565V11.0391H151.836V39.3088H167.901V47.5565H142.404Z"
                            fill="white"
                        />
                        <path
                            d="M177.066 46.476V18.2062H165.303V12.1519H195.878V18.2062H184.114V46.476H177.066Z"
                            fill="white"
                        />
                        <path
                            fillRule="evenodd"
                            clipRule="evenodd"
                            d="M175.874 47.579V19.3093H164.11V11.0615H197.07V19.3093H185.306V47.579H175.874ZM210.591 47.579V19.3093H200.191V11.0615H231.787V19.3093H220.023V47.579H210.591Z"
                            fill="white"
                        />
                        <g clipPath="url(#clip1_439_1298)">
                            <path
                                d="M692.441 4.93164H703.847L720.822 53.5275H708.807L706.43 46.4029H689.794L687.417 53.5275H675.465L692.441 4.93164ZM693.389 35.8165H702.892L698.137 21.6367L693.382 35.8165H693.389Z"
                                fill="white"
                            />
                            <path
                                d="M719.634 36.8848C719.634 27.2974 727.106 19.5068 737.494 19.5068C745.78 19.5068 752.162 24.2311 754.469 31.0228L743.947 34.5539C743.133 31.7581 740.621 30.0238 737.699 30.0238C733.899 30.0238 731.047 32.9513 731.047 36.8779C731.047 40.8044 733.899 43.6695 737.699 43.6695C740.55 43.6695 742.928 41.8727 743.876 39.1394L754.54 43.0035C752.098 49.4621 745.914 54.1864 737.494 54.1864C727.035 54.1864 719.634 46.4652 719.634 36.8779"
                                fill="white"
                            />
                            <path
                                d="M756.167 20.2424H761.736V12.4518L773.277 6.39551V20.2424H779.454V30.0933H773.277V37.3498C773.277 42.6083 773.751 43.0106 779.454 43.0106V53.5276H776.263C764.786 53.5276 761.736 49.934 761.736 38.0158V30.0933H756.167V20.2424Z"
                                fill="white"
                            />
                            <path
                                d="M783.077 5.77789L819.737 0.193359V11.8411L783.077 17.4256V5.77789ZM783.077 20.2491H819.737V53.5343H783.077V20.2422V20.2491Z"
                                fill="white"
                            />
                            <path
                                d="M822.186 36.8848C822.186 27.2974 829.658 19.5762 840.045 19.5762C850.433 19.5762 857.905 27.2974 857.905 36.8848C857.905 46.4721 850.433 54.1933 840.045 54.1933C829.658 54.1933 822.186 46.4721 822.186 36.8848ZM846.633 36.8848C846.633 33.0207 843.781 30.0307 840.045 30.0307C836.309 30.0307 833.528 33.0276 833.528 36.8848C833.528 40.7419 836.316 43.6764 840.045 43.6764C843.774 43.6764 846.633 40.7488 846.633 36.8848Z"
                                fill="white"
                            />
                            <path
                                d="M860.347 20.2422H871.824V23.9675C873.862 21.2411 876.919 19.5762 880.584 19.5762C887.851 19.5762 892.599 24.238 892.599 32.2923V53.5274H880.853V34.755C880.853 31.2933 879.424 29.3647 876.437 29.3647C873.791 29.3647 871.888 31.2308 871.888 35.2198V53.5274H860.347V20.2422Z"
                                fill="white"
                            />
                            <path
                                d="M895.719 12.7222V4.93164H907.465V12.7222C907.465 21.6436 906.446 30.6274 904.953 39.5488H898.302C896.738 30.6274 895.719 21.6436 895.719 12.7222ZM895.719 41.8797H907.465V53.5275H895.719V41.8797Z"
                                fill="white"
                            />
                        </g>
                        <defs>
                            <clipPath id="clip0_439_1298">
                                <rect width="231.217" height="58.553" fill="white" transform="translate(338 0.03125)" />
                            </clipPath>
                            <clipPath id="clip1_439_1298">
                                <rect width="232" height="54" fill="white" transform="translate(675.431 0.03125)" />
                            </clipPath>
                        </defs>
                    </svg>
                </div>
            </section>

            <section className="cinema-artistic-descriptions">
                <div className="container">
                    <div className="cinema-artistic-descriptions-wrapper">
                        <p className="cinema-artistic-descriptions__description">
                            С&nbsp;какими сумками появляются в&nbsp;кадре героини кино? THE CULTT, ресейл-платформа
                            с&nbsp;кураторским отбором, собрала сумки в&nbsp;точности как в&nbsp;культовых фильмах.
                            Инсталляция представлена в&nbsp;кинотеатре &laquo;Художественный&raquo;&nbsp;&mdash; найдите
                            все сумки на&nbsp;пьедесталах, установленных от&nbsp;вестибюля до&nbsp;фойе Камерного зала.
                        </p>

                        <p className="cinema-artistic-descriptions__description">
                            Herm&egrave;s Birkin Марго Тененбаум, Chanel Timeless Classic принцессы Дианы
                            из&nbsp;&laquo;Спенсер&raquo;, Gucci Jackie из&nbsp;&laquo;Дома Gucci&raquo;&nbsp;&mdash;
                            каждый аксессуар, который подбирают художники по&nbsp;костюмам, рассказывает свою историю
                            о&nbsp;характере героини. Узнайте секреты, зашифрованные в&nbsp;каждой сумке,
                            в&nbsp;кинотеатре &laquo;Художественный&raquo; с&nbsp;6&nbsp;по&nbsp;27&nbsp;августа.
                        </p>
                    </div>
                </div>
            </section>

            <section className="cinema-artistic-auctioninfo">
                <div className="container">
                    <div className="cinema-artistic-auctioninfo-wrapper">
                        <h2 className="cinema-artistic-auctioninfo__title">АУКЦИОН</h2>

                        <p className="cinema-artistic-auctioninfo__description">
                            Скоро экспонаты из&nbsp;инсталляции и&nbsp;еще несколько сумок &laquo;как в&nbsp;кино&raquo;
                            из&nbsp;коллекции THE&nbsp;CULTT можно будет приобрести на&nbsp;онлайн-аукционе.
                            Мы&nbsp;проводим его при участии культурно-благотворительного фонда Action!
                        </p>

                        <CinemaArtisticFormSubscribe onSubmit={onSubmitSubscribeForm} dark />
                    </div>
                </div>
            </section>

            <section className="cinema-artistic-red-image">
                <picture className="cinema-artistic-red-image__picture">
                    <source media="(min-width:745px)" srcSet={CinemaArtisticRedImage.src} />
                    <source media="(min-width:391px)" srcSet={CinemaArtisticRedTabletImage.src} />
                    <img src={CinemaArtisticRedMobileImage.src} alt="" />
                </picture>
            </section>

            <section className="cinema-artistic-companies">
                <div className="container">
                    <div className="cinema-artistic-companies-wrapper">
                        <div className="cinema-artistic-companies-block">
                            <svg viewBox="0 0 233 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    fillRule="evenodd"
                                    clipRule="evenodd"
                                    d="M0.5 22.389V18.5967H15.0127V22.389H9.50118V37.3449H4.56698V22.389H0.5ZM17.665 37.2891V18.7174H22.5992V26.2839H30.5538V18.7174H35.3983V37.2891H30.5538V29.3964H22.5992V37.2891H17.665ZM39.0167 37.2078V18.5967H54.208V22.5227H43.8313V26.0369H51.6064V29.551H43.8313V33.7516H54.6865V37.2078H39.0167Z"
                                    fill="#A60215"
                                />
                                <path
                                    d="M76.784 37.602C73.0401 37.602 69.8076 36.8541 67.0864 35.3583C64.3825 33.8625 62.2939 31.77 60.8206 29.0807C59.3647 26.3915 58.6367 23.2646 58.6367 19.7002C58.6367 16.1357 59.3647 13.0089 60.8206 10.3196C62.2939 7.63035 64.3825 5.53783 67.0864 4.04203C69.8076 2.54624 73.0401 1.79834 76.784 1.79834C81.0824 1.79834 84.6876 2.77697 87.5995 4.73424C90.5287 6.6915 92.5913 9.34097 93.7872 12.6826L86.6635 14.4967C85.9702 12.4121 84.8003 10.797 83.1537 9.65127C81.5071 8.48964 79.3838 7.90882 76.784 7.90882C74.4094 7.90882 72.4248 8.39416 70.8302 9.36484C69.2529 10.3355 68.0657 11.704 67.2684 13.4703C66.4711 15.2366 66.0724 17.3132 66.0724 19.7002C66.0724 22.0871 66.4711 24.1637 67.2684 25.93C68.0657 27.6963 69.2529 29.0648 70.8302 30.0355C72.4248 31.0062 74.4094 31.4915 76.784 31.4915C79.3838 31.4915 81.5071 30.9107 83.1537 29.749C84.8003 28.5874 85.9702 26.9723 86.6635 24.9036L93.7872 26.7177C92.5913 30.0593 90.5287 32.7088 87.5995 34.6661C84.6876 36.6233 81.0824 37.602 76.784 37.602Z"
                                    fill="#A60215"
                                />
                                <path
                                    fillRule="evenodd"
                                    clipRule="evenodd"
                                    d="M66.4698 36.2939L66.4684 36.2931C63.5634 34.686 61.322 32.4352 59.7514 29.5683L59.7501 29.566L59.7489 29.5637C58.1967 26.6967 57.4399 23.3969 57.4399 19.6943C57.4399 15.9917 58.1967 12.692 59.7489 9.82499L59.7501 9.82266L59.7514 9.82034C61.322 6.95345 63.5634 4.70263 66.4684 3.09559L66.4698 3.0948L66.4713 3.094C69.4093 1.47903 72.8625 0.694336 76.7833 0.694336C81.2853 0.694336 85.1505 1.72213 88.304 3.84134C91.4475 5.94214 93.6537 8.78734 94.923 12.334L95.3143 13.4274L85.8593 15.8352L85.5189 14.8116C84.8877 12.9138 83.8477 11.5067 82.4306 10.5207L82.4274 10.5185L82.4242 10.5162C81.0346 9.53586 79.1872 9.00118 76.7833 9.00118C74.5883 9.00118 72.8487 9.44829 71.493 10.2728C70.1319 11.1112 69.0884 12.2995 68.3728 13.8849C67.6486 15.4893 67.268 17.4171 67.268 19.6943C67.268 21.9716 67.6486 23.8994 68.3728 25.5037C69.0884 27.0891 70.1318 28.2774 71.4929 29.1158C72.8486 29.9403 74.5882 30.3875 76.7833 30.3875C79.1872 30.3875 81.0346 29.8528 82.4242 28.8724C83.8482 27.8679 84.889 26.4564 85.5196 24.5748L85.8617 23.5541L95.3143 25.9612L94.923 27.0547C93.6537 30.6013 91.4475 33.4465 88.304 35.5473C85.1505 37.6665 81.2853 38.6943 76.7833 38.6943C72.8625 38.6943 69.4093 37.9096 66.4713 36.2947L66.4698 36.2939Z"
                                    fill="#A60215"
                                />
                                <path
                                    d="M118.056 37.6022C115.04 37.6022 112.388 37.0453 110.1 35.9314C107.813 34.8016 106.027 33.2183 104.745 31.1814C103.462 29.1446 102.821 26.7497 102.821 23.9968V2.56239L109.996 2.51465V23.9491C109.996 25.0789 110.204 26.1053 110.62 27.0282C111.036 27.9511 111.608 28.7468 112.336 29.4151C113.082 30.0834 113.94 30.6006 114.91 30.9666C115.898 31.3167 116.947 31.4917 118.056 31.4917C119.2 31.4917 120.257 31.3087 121.228 30.9427C122.216 30.5767 123.074 30.0596 123.802 29.3912C124.53 28.7229 125.093 27.9273 125.492 27.0043C125.908 26.0814 126.116 25.063 126.116 23.9491V2.51465H133.292V23.9968C133.292 26.7497 132.65 29.1446 131.368 31.1814C130.085 33.2183 128.3 34.8016 126.012 35.9314C123.724 37.0453 121.072 37.6022 118.056 37.6022Z"
                                    fill="#A60215"
                                />
                                <path
                                    fillRule="evenodd"
                                    clipRule="evenodd"
                                    d="M109.538 36.892L109.535 36.8904C107.054 35.6655 105.105 33.9388 103.71 31.723C102.305 29.4926 101.625 26.9015 101.625 23.9887V1.46404L111.194 1.40039V23.941C111.194 24.9455 111.378 25.8268 111.727 26.6002C112.085 27.3953 112.57 28.0663 113.178 28.626C113.809 29.1902 114.531 29.6265 115.354 29.9382C116.194 30.2345 117.093 30.3855 118.057 30.3855C119.059 30.3855 119.961 30.2257 120.774 29.9188L120.778 29.9175L120.781 29.9162C121.625 29.6035 122.347 29.1669 122.957 28.6066C123.564 28.0495 124.039 27.3822 124.381 26.5914L124.384 26.5839L124.387 26.5764C124.737 25.8011 124.921 24.9274 124.921 23.941V1.40838H134.489V23.9887C134.489 26.9015 133.809 29.4926 132.404 31.723C131.009 33.9388 129.06 35.6655 126.579 36.8904L126.576 36.892L126.573 36.8935C124.086 38.1043 121.236 38.6923 118.057 38.6923C114.878 38.6923 112.028 38.1043 109.541 36.8935L109.538 36.892Z"
                                    fill="#A60215"
                                />
                                <path
                                    d="M144.011 36.8861V2.51465H151.083V30.8234H167.202V36.8861H144.011Z"
                                    fill="#A60215"
                                />
                                <path
                                    fillRule="evenodd"
                                    clipRule="evenodd"
                                    d="M142.815 37.9682V1.40039H152.279V29.7091H168.398V37.9682H142.815Z"
                                    fill="#A60215"
                                />
                                <path
                                    d="M177.595 36.8861V8.5774H165.791V2.51465H196.47V8.5774H184.666V36.8861H177.595Z"
                                    fill="#A60215"
                                />
                                <path
                                    fillRule="evenodd"
                                    clipRule="evenodd"
                                    d="M176.398 37.9907V9.68196H164.594V1.42285H197.665V9.68196H185.862V37.9907H176.398ZM211.232 37.9907V9.68196H200.797V1.42285H232.5V9.68196H220.696V37.9907H211.232Z"
                                    fill="#A60215"
                                />
                            </svg>

                            <p className="cinema-artistic-companies-block__description">
                                THE CULTT&nbsp;&mdash; ресейл-платформа культовых сумок и&nbsp;аксессуаров
                                с&nbsp;кураторским отбором. Здесь можно купить или выставить на&nbsp;продажу знаковые
                                аксессуары, от&nbsp;коллекционных Hermes и&nbsp;Chanel до&nbsp;молодых инди-брендов,
                                всколыхнувших социальные сети. Каждый лот проходит проверку на&nbsp;подлинность.
                            </p>
                        </div>

                        <div className="cinema-artistic-companies-block">
                            <svg viewBox="0 0 393 100" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M96.7993 41.3524C96.9214 40.27 95.341 38.2811 94.2493 36.8939L81.4282 20.4473V36.8939C81.4282 38.3397 81.9761 40.5084 82.4017 41.3524V41.6532H76.813V41.3524C77.2386 40.5084 77.7865 38.3397 77.7865 36.8939V5.45039C77.7865 4.00462 77.2386 1.83596 76.813 0.991946V0.69107H82.4017V0.991946C81.9761 1.83596 81.4282 4.00462 81.4282 5.45039V18.4623L95.4001 4.06714C96.1884 3.22312 96.7993 1.65622 97.1028 0.694977H100.689V0.937242L83.86 17.9856L102.333 41.3602V41.6611H96.8032V41.3602L96.7993 41.3524ZM104.276 0.991946V0.69107H109.806V0.991946C109.38 1.83596 108.832 4.00462 108.832 5.45039V37.7379L125.054 0.69107H129.611V0.991946C129.185 1.83596 128.637 4.00462 128.637 5.45039V36.8978C128.637 38.3436 129.185 40.5123 129.611 41.3563V41.6572H124.081V41.3563C124.507 40.5123 125.054 38.3436 125.054 36.8978V4.42663L108.832 41.6532H104.276V41.3524C104.702 40.5084 105.249 38.3397 105.249 36.8939V5.45039C105.249 4.00462 104.702 1.83596 104.276 0.991946ZM133.501 0.991946V0.69107H139.089V0.991946C138.664 1.83596 138.116 4.00462 138.116 5.45039V18.6421H153.913V5.45039C153.913 4.00462 153.365 1.83596 152.939 0.991946V0.69107H158.528V0.991946C158.102 1.83596 157.554 4.00462 157.554 5.45039V36.8978C157.554 38.3436 158.102 40.5123 158.528 41.3563V41.6572H152.939V41.3563C153.365 40.5123 153.913 38.3436 153.913 36.8978V19.9081H138.116V36.8939C138.116 38.3397 138.664 40.5084 139.089 41.3524V41.6532H133.501V41.3524C133.926 40.5084 134.474 38.3397 134.474 36.8939V5.45039C134.474 4.00462 133.926 1.83596 133.501 0.991946ZM161.633 21.5336C161.633 11.7766 165.949 0.210449 174.817 0.210449C183.685 0.210449 188.001 11.7766 188.001 21.5336C188.001 32.7364 182.715 42.1339 174.817 42.1339C166.919 42.1339 161.633 32.7364 161.633 21.5336ZM183.933 21.5336C183.933 12.1947 182.172 1.53509 174.821 1.53509C167.471 1.53509 165.709 12.1986 165.709 21.5336C165.709 31.8337 168.2 40.8092 174.821 40.8092C181.442 40.8092 183.933 31.8337 183.933 21.5336ZM213.647 0.69107L214.924 5.20812H214.561C213.347 4.06323 209.154 2.01571 207.818 2.01571H203.08V36.8978C203.08 38.3436 203.628 40.5123 204.054 41.3563V41.6572H198.465V41.3563C198.891 40.5123 199.438 38.3436 199.438 36.8978V2.01571H194.76C193.361 2.01571 188.683 4.36411 187.65 5.20812H187.283L188.801 0.69107H213.651H213.647ZM236.372 37.1948H236.739L235.462 41.6532H217.174V41.3524C217.6 40.5084 218.148 38.3397 218.148 36.8939V5.45039C218.148 4.00462 217.6 1.83596 217.174 0.991946V0.69107H234.918L236.195 5.14951H235.832C234.618 4.00462 230.91 1.9571 229.089 1.9571H221.797V18.7046H233.889V19.9706H221.797V40.3911H229.637C231.457 40.3911 235.166 38.3436 236.38 37.1987L236.372 37.1948ZM242.146 41.6532H238.441L238.382 41.3524L251.503 0.210449H253.994L269.002 41.3524V41.6532H263.536V41.3524C263.839 40.1489 263.536 37.1362 262.684 34.7253L258.916 24.4837H245.488L242.694 33.4592C241.48 37.3159 241.539 39.6643 242.146 41.3524V41.6532ZM258.432 23.1591L251.625 4.54385L245.851 23.1591H258.428H258.432ZM290.573 0.69107L291.85 5.20812H291.487C290.273 4.06323 286.08 2.01571 284.744 2.01571H280.006V36.8978C280.006 38.3436 280.554 40.5123 280.98 41.3563V41.6572H275.391V41.3563C275.817 40.5123 276.364 38.3436 276.364 36.8978V2.01571H271.686C270.287 2.01571 265.609 4.36411 264.576 5.20812H264.213L265.731 0.69107H290.581H290.573ZM294.1 0.991946V0.69107C295.192 0.749682 297.139 0.812202 298.416 0.812202C299.693 0.812202 302.243 0.69107 305.037 0.69107C311.722 0.69107 316.581 4.36411 316.581 10.3308C316.581 16.9579 311.722 20.6935 302.424 20.6935H298.719V36.9564C298.719 38.4022 299.267 40.5123 299.693 41.3524V41.6532H294.104V41.3524C294.53 40.5084 295.078 38.3397 295.078 36.8939V5.45039C295.078 4.00462 294.53 1.83596 294.104 0.991946H294.1ZM298.719 2.01571V19.4275H302.424C309.593 19.4275 312.451 16.1139 312.451 10.6942C312.451 5.27455 309.172 2.01962 303.823 2.01962H298.719V2.01571Z"
                                    fill="#A60215"
                                />
                                <path
                                    d="M22.4074 93.2866V92.9857C22.4074 91.7822 21.8004 89.0118 20.2791 86.3586L13.1099 73.7101L6.60677 85.0965C4.36023 88.9532 4.47847 91.3016 4.90413 92.9896V93.2905H0.53324L0.474121 92.9896L12.2625 72.1471L1.02196 52.3244H6.91419V52.6253C6.79201 53.8288 7.46203 56.7204 8.92031 59.2524L14.7534 69.4939L19.9796 60.5184C22.167 56.7243 22.167 54.3133 21.7413 52.6253V52.3244H26.4788L26.3566 52.6253L15.6008 70.9983L28.2996 93.2866H22.4074ZM31.0388 88.3475C31.0388 87.3824 31.2201 86.4798 31.4645 85.6357H33.1041C32.8597 86.4172 32.6784 87.2613 32.6784 88.3475C32.6784 90.1528 33.4667 91.7197 35.1693 91.7197C38.2672 91.7197 39.7885 87.863 41.6094 82.9865L41.7907 82.4433L29.214 52.3244H34.6215V52.6253C34.318 53.8288 34.8658 56.7829 35.8984 59.2524L43.5524 77.8051L50.1738 60.5184C51.7542 56.3023 51.4508 54.3133 51.0251 52.6253V52.3244H54.9152L54.9743 52.6253L43.0637 83.5882C40.8172 89.4924 39.2367 93.2866 35.1023 93.2866C32.1857 93.2866 31.0309 91.1179 31.0309 88.3475H31.0388ZM52.2469 91.962C56.4404 90.5748 59.0535 80.0949 59.4792 68.2865L59.9048 56.9626C59.964 55.5168 59.1166 53.3482 57.4139 52.6253V52.3244H76.675V52.6253C76.2494 53.4693 75.7015 55.638 75.7015 57.0837V88.5273C75.7015 89.551 76.005 90.9382 76.3085 91.962H79.1029L80.3798 99.4917H80.0172C78.1333 96.3579 75.5833 93.2866 73.2106 93.2866H56.137C54.7378 93.2866 51.8843 96.2368 49.756 99.4917H49.3934L50.9108 91.962H52.2469ZM55.2226 91.962H72.0519V53.5905H61.7848L61.1148 68.4076C60.63 79.0712 58.8052 88.4062 55.2226 91.962ZM81.9603 73.167C81.9603 63.41 86.276 51.8438 95.1439 51.8438C104.012 51.8438 108.328 63.41 108.328 73.167C108.328 84.3697 103.042 93.7672 95.1439 93.7672C87.2456 93.7672 81.9603 84.3697 81.9603 73.167ZM104.26 73.167C104.26 63.8281 102.498 53.1684 95.1479 53.1684C87.7973 53.1684 86.0356 63.832 86.0356 73.167C86.0356 83.4671 88.5265 92.4426 95.1479 92.4426C101.769 92.4426 104.26 83.4671 104.26 73.167ZM108.272 92.9857L121.456 67.2628L109.486 52.5628V52.3205H113.313C113.313 53.2857 113.617 55.0909 114.346 55.9936L126.56 71.1741V57.0798C126.56 55.6341 126.012 53.4654 125.586 52.6214V52.3205H131.116V52.6214C130.69 53.4654 130.143 55.6341 130.143 57.0798V71.2367L142.357 55.9975C143.086 55.0948 143.389 53.2857 143.389 52.3244H147.216V52.5667L135.247 67.2667L148.43 92.9896V93.2905H143.507V92.9896C143.811 91.9073 142.837 90.0981 142.049 88.5312L132.874 70.1582L130.139 73.5929V88.5312C130.139 89.977 130.686 92.1456 131.112 92.9896V93.2905H125.582V92.9896C126.008 92.1456 126.556 89.977 126.556 88.5312V73.5929L123.762 70.1582L114.586 88.5312C113.798 90.0981 112.825 91.9034 113.128 92.9896V93.2905H108.268V92.9896L108.272 92.9857ZM169.52 88.8282H169.883L168.606 93.2866H150.318V92.9857C150.744 92.1417 151.292 89.9731 151.292 88.5273V57.0837C151.292 55.638 150.744 53.4693 150.318 52.6253V52.3244H168.062L169.339 56.7829H168.976C167.762 55.638 164.053 53.5905 162.233 53.5905H154.941V70.3379H167.033V71.604H154.941V92.0245H162.78C164.601 92.0245 168.31 89.977 169.524 88.8321L169.52 88.8282ZM192.549 54.0086C192.975 54.0086 193.4 53.8874 193.704 53.7077H194.066V61.1788H193.156C192.852 56.1772 190.117 53.2271 185.561 53.2271C178.817 53.2271 175.96 62.8043 175.96 72.5027C175.96 82.2011 177.903 92.3215 185.013 92.3215C189.569 92.3215 192.123 88.3475 193.156 81.9588H194.614C193.582 88.707 190.846 93.7672 185.013 93.7672C176.204 93.7672 171.889 83.1037 171.889 72.5027C171.889 61.9017 177.355 51.8399 185.498 51.8399C190.054 51.8399 191.087 54.0086 192.545 54.0086H192.549ZM222.932 52.3205L224.209 56.8376H223.843C222.629 55.6927 218.435 53.6452 217.099 53.6452H212.362V88.5234C212.362 89.9691 212.91 92.1378 213.335 92.9818V93.2827H207.747V92.9818C208.172 92.1378 208.72 89.9691 208.72 88.5234V53.6452H204.042C202.643 53.6452 197.964 55.9936 196.932 56.8376H196.565L198.083 52.3205H222.932ZM226.46 52.6214V52.3205C227.552 52.3791 229.499 52.4417 230.776 52.4417C232.053 52.4417 232.841 52.3205 235.635 52.3205C242.32 52.3205 247.242 55.9936 247.242 61.5383C247.242 67.083 243.778 69.7323 240.073 71.1155C245.421 71.9595 249.674 75.6326 249.674 81.0562C249.674 86.4798 246.513 93.2866 236.549 93.2866H226.464V92.9857C226.889 92.1417 227.437 89.9731 227.437 88.5273V57.0837C227.437 55.638 226.889 53.4693 226.464 52.6253L226.46 52.6214ZM231.079 70.8733H235.15C240.739 70.8733 243.049 67.7395 243.049 61.4758C243.049 56.8376 240.983 53.6452 234.421 53.6452H231.079V70.8733ZM237.46 72.1393H231.079V88.5859C231.079 89.6097 231.382 90.9968 231.686 92.0206H236.364C243.23 92.0206 245.477 86.8393 245.477 81.4196C245.477 75.9999 242.804 72.1432 237.456 72.1432L237.46 72.1393ZM271.729 88.8243H272.096L270.819 93.2827H252.531V92.9818C252.957 92.1378 253.505 89.9691 253.505 88.5234V57.0798C253.505 55.6341 252.957 53.4654 252.531 52.6214V52.3205H270.275L271.552 56.779H271.19C269.976 55.6341 266.267 53.5866 264.446 53.5866H257.155V70.334H269.246V71.6001H257.155V92.0206H264.994C266.815 92.0206 270.523 89.9731 271.737 88.8282L271.729 88.8243ZM275.135 52.6214V52.3205H280.723V52.6214C280.298 53.4654 279.75 55.6341 279.75 57.0798V70.2715H295.547V57.0798C295.547 55.6341 294.999 53.4654 294.573 52.6214V52.3205H300.162V52.6214C299.736 53.4654 299.188 55.6341 299.188 57.0798V88.5234C299.188 89.9691 299.736 92.1378 300.162 92.9818V93.2827H294.573V92.9818C294.999 92.1378 295.547 89.9691 295.547 88.5234V71.5375H279.75V88.5234C279.75 89.9691 280.298 92.1378 280.723 92.9818V93.2827H275.135V92.9818C275.56 92.1378 276.108 89.9691 276.108 88.5234V57.0798C276.108 55.6341 275.56 53.4654 275.135 52.6214ZM303.997 52.6214V52.3205H309.586V52.6214C309.16 53.4654 308.612 55.6341 308.612 57.0798V70.2715H324.409V57.0798C324.409 55.6341 323.861 53.4654 323.435 52.6214V52.3205H329.024V52.6214C328.598 53.4654 328.051 55.6341 328.051 57.0798V88.5234C328.051 89.9691 328.598 92.1378 329.024 92.9818V93.2827H323.435V92.9818C323.861 92.1378 324.409 89.9691 324.409 88.5234V71.5375H308.612V88.5234C308.612 89.9691 309.16 92.1378 309.586 92.9818V93.2827H303.997V92.9818C304.422 92.1378 304.97 89.9691 304.97 88.5234V57.0798C304.97 55.6341 304.422 53.4654 303.997 52.6214ZM355.159 80.8725C355.159 86.4759 351.087 93.2827 342.034 93.2827H332.859V92.9818C333.285 92.1378 333.832 89.9691 333.832 88.5234V57.0798C333.832 55.6341 333.285 53.4654 332.859 52.6214V52.3205H338.448V52.6214C338.022 53.4654 337.474 55.5716 337.474 57.0173V69.6659H342.093C351.087 69.6659 355.155 75.2692 355.155 80.8686L355.159 80.8725ZM341.853 91.9581C348.778 91.9581 350.965 86.2961 350.965 80.8139C350.965 75.3317 348.533 70.9358 341.609 70.9358H337.478V91.9581H341.853ZM357.713 52.6214V52.3205H363.301V52.6214C362.876 53.4654 362.328 55.6341 362.328 57.0798V88.5234C362.328 89.9691 362.876 92.1378 363.301 92.9818V93.2827H357.713V92.9818C358.138 92.1378 358.686 89.9691 358.686 88.5234V57.0798C358.686 55.6341 358.138 53.4654 357.713 52.6214ZM367.191 52.6214V52.3205H372.721V52.6214C372.295 53.4654 371.748 55.6341 371.748 57.0798V89.3674L387.97 52.3205H392.526V52.6214C392.1 53.4654 391.553 55.6341 391.553 57.0798V88.5234C391.553 89.9691 392.1 92.1378 392.526 92.9818V93.2827H386.996V92.9818C387.422 92.1378 387.97 89.9691 387.97 88.5234V56.0561L371.748 93.2827H367.191V92.9818C367.617 92.1378 368.165 89.9691 368.165 88.5234V57.0798C368.165 55.6341 367.617 53.4654 367.191 52.6214ZM374.542 47.0181H377.214C377.214 49.3079 378.428 50.3902 380.253 50.3902C382.078 50.3902 383.292 49.3079 383.292 47.0181H385.964C385.964 49.9682 383.595 51.414 380.312 51.414C377.029 51.414 374.538 49.9682 374.538 47.0181H374.542Z"
                                    fill="#A60215"
                                />
                            </svg>

                            <p className="cinema-artistic-companies-block__description">
                                &laquo;Художественный&raquo;&nbsp;&mdash; один из&nbsp;старейших кинотеатров мира,
                                открытый в&nbsp;1909&nbsp;году. В&nbsp;нем проходили важнейшие премьеры, показывали
                                первые звуковые и&nbsp;цветные фильмы, а&nbsp;само здание всегда было оборудовано
                                по&nbsp;последнему слову техники. Сегодня &laquo;Художественный&raquo;&nbsp;&mdash; это
                                активное общественное пространство и&nbsp;место силы для тех, кто искренне любит кино.
                            </p>
                        </div>

                        <div className="cinema-artistic-companies-block">
                            <svg viewBox="0 0 233 55" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clipPath="url(#clip0_439_1268)">
                                    <path
                                        d="M17.5094 5.3916H28.9159L45.8912 53.9874H33.8762L31.4986 46.8628H14.863L12.4855 53.9874H0.53418L17.5094 5.3916ZM18.4576 36.2765H27.9607L23.2056 22.0966L18.4506 36.2765H18.4576Z"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M44.7021 37.3448C44.7021 27.7574 52.1744 19.9668 62.5619 19.9668C70.8479 19.9668 77.2304 24.6911 79.5372 31.4827L69.0152 35.0138C68.2015 32.2181 65.6895 30.4838 62.7671 30.4838C58.9673 30.4838 56.1157 33.4113 56.1157 37.3378C56.1157 41.2643 58.9673 44.1294 62.7671 44.1294C65.6187 44.1294 67.9963 42.3327 68.9444 39.5994L79.6079 43.4635C77.1667 49.9221 70.9823 54.6464 62.5619 54.6464C52.1036 54.6464 44.7021 46.9252 44.7021 37.3378"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M81.2358 20.7023H86.8046V12.9117L98.3455 6.85547V20.7023H104.523V30.5533H98.3455V37.8097C98.3455 43.0682 98.8196 43.4706 104.523 43.4706V53.9875H101.332C89.8544 53.9875 86.8046 50.394 86.8046 38.4757V30.5533H81.2358V20.7023Z"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M108.146 6.23785L144.806 0.65332V12.3011L108.146 17.8856V6.23785ZM108.146 20.7091H144.806V53.9943H108.146V20.7021V20.7091Z"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M147.254 37.3447C147.254 27.7574 154.727 20.0361 165.114 20.0361C175.502 20.0361 182.974 27.7574 182.974 37.3447C182.974 46.9321 175.502 54.6533 165.114 54.6533C154.727 54.6533 147.254 46.9321 147.254 37.3447ZM171.702 37.3447C171.702 33.4806 168.85 30.4907 165.114 30.4907C161.378 30.4907 158.597 33.4876 158.597 37.3447C158.597 41.2019 161.385 44.1363 165.114 44.1363C168.843 44.1363 171.702 41.2088 171.702 37.3447Z"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M185.415 20.7021H196.892V24.4274C198.93 21.7011 201.987 20.0361 205.652 20.0361C212.919 20.0361 217.667 24.698 217.667 32.7522V53.9873H205.921V35.215C205.921 31.7532 204.492 29.8247 201.506 29.8247C198.859 29.8247 196.956 31.6908 196.956 35.6798V53.9873H185.415V20.7021Z"
                                        fill="#A60215"
                                    />
                                    <path
                                        d="M220.788 13.1822V5.3916H232.534V13.1822C232.534 22.1036 231.515 31.0874 230.022 40.0088H223.371C221.807 31.0874 220.788 22.1036 220.788 13.1822ZM220.788 42.3397H232.534V53.9874H220.788V42.3397Z"
                                        fill="#A60215"
                                    />
                                </g>
                                <defs>
                                    <clipPath id="clip0_439_1268">
                                        <rect
                                            width="232"
                                            height="54"
                                            fill="white"
                                            transform="translate(0.5 0.491211)"
                                        />
                                    </clipPath>
                                </defs>
                            </svg>

                            <p className="cinema-artistic-companies-block__description">
                                Фонд Action! Светланы Бондарчук и&nbsp;Евгении Поповой объединяет известных российских
                                кинематографистов и&nbsp;меценатов для помощи детям и&nbsp;взрослым, попавшим
                                в&nbsp;сложную ситуацию. При участии фонда уже более 10&nbsp;лет проводятся
                                благотворительные киновечера: для них режиссеры бесплатно снимают короткометражки
                                с&nbsp;участием признанных звезд кино. Все вырученные средства поступают
                                в&nbsp;благотворительные организации.
                            </p>
                        </div>
                    </div>
                </div>
            </section>

            <section className="cinema-artistic-exhibits">
                <div className="container">
                    <div className="cinema-artistic-exhibits-wrapper">
                        <h2 className="cinema-artistic-exhibits__title">ЭКСПОНАТЫ</h2>
                    </div>
                </div>
            </section>

            {exhibits.map((exhibit, index) => (
                <section className="cinema-artistic-exhibit" key={`cinema-artistic-exhibit-${index}`}>
                    <div className="cinema-artistic-exhibit-wrapper">
                        <p className="cinema-artistic-exhibit__number">{index + 1}</p>

                        <div
                            className="cinema-artistic-exhibit-cover"
                            style={{ backgroundImage: `url("${isMobile ? exhibit.coverMedia : exhibit.cover}")` }}
                        ></div>

                        <div className="cinema-artistic-exhibit-info-wrapper border">
                            <div className="cinema-artistic-exhibit-info">
                                <div className="cinema-artistic-exhibit-info-options">
                                    <div className="cinema-artistic-exhibit-info-options-item">
                                        <p className="cinema-artistic-exhibit-info-options-item__title">СУМКА</p>

                                        <div className="cinema-artistic-exhibit-info-options-item-line"></div>

                                        <p className="cinema-artistic-exhibit-info-options-item__value">
                                            {exhibit.option.title}
                                        </p>
                                    </div>

                                    <div className="cinema-artistic-exhibit-info-options-item">
                                        <p className="cinema-artistic-exhibit-info-options-item__title">ГОД ВЫПУСКА</p>

                                        <div className="cinema-artistic-exhibit-info-options-item-line"></div>

                                        <p className="cinema-artistic-exhibit-info-options-item__value">
                                            {exhibit.option.year}
                                        </p>
                                    </div>

                                    <div className="cinema-artistic-exhibit-info-options-item">
                                        <p className="cinema-artistic-exhibit-info-options-item__title">ФИЛЬМ</p>

                                        <div className="cinema-artistic-exhibit-info-options-item-line"></div>

                                        <p className="cinema-artistic-exhibit-info-options-item__value">
                                            {exhibit.option.film}
                                        </p>
                                    </div>
                                </div>

                                <p
                                    className="cinema-artistic-exhibit-info__description"
                                    dangerouslySetInnerHTML={{
                                        __html: exhibit.description1,
                                    }}
                                ></p>
                            </div>
                        </div>

                        <BaseImage src={exhibit.image} alt="" className="cinema-artistic-exhibit-image" />

                        <div className="cinema-artistic-exhibit-info-wrapper">
                            <div className="cinema-artistic-exhibit-info">
                                <p
                                    className="cinema-artistic-exhibit-info__description"
                                    dangerouslySetInnerHTML={{
                                        __html: exhibit.description2,
                                    }}
                                ></p>
                            </div>
                        </div>
                    </div>
                </section>
            ))}

            <section className="cinema-artistic-auction">
                <div className="container">
                    <div className="cinema-artistic-auction-wrapper">
                        <h2 className="cinema-artistic-auction__title">АУКЦИОН</h2>

                        <p className="cinema-artistic-auction__subtitle">
                            15% средств, вырученных на онлайн-аукционе, будут перечислены в культурно-благотворительный
                            фонд Action!
                        </p>

                        <p className="cinema-artistic-auction__description">
                            Фонд Action! Светланы Бондарчук и&nbsp;Евгении Поповой объединяет известных российских
                            кинематографистов и&nbsp;меценатов для помощи детям и&nbsp;взрослым, попавшим в&nbsp;сложную
                            ситуацию. При участии фонда уже более 10&nbsp;лет проводятся благотворительные киновечера:
                            для них режиссеры бесплатно снимают короткометражки с&nbsp;участием признанных звезд кино.
                            Все вырученные средства поступают в&nbsp;благотворительные организации.
                        </p>

                        <CinemaArtisticFormSubscribe onSubmit={onSubmitSubscribeForm} />
                    </div>
                </div>
            </section>
        </>
    );
};

export default CinemaArtistic;
