import React from 'react';

import { getClassNames } from '@/functions/getClassNames';
import { ProductPage } from '@/models/IProduct';
import { ProductInfoProperty } from './ProductInfoProperty';

const ProductInfoState: React.FC<ProductPage> = ({ condition, nuances }) => {
    return (
        <div className="product-content-info-state">
            <h3 className="product-content-info-state__title product-content-title">
                Состояние
                <svg width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M8.16035 6.44409C7.98894 6.56193 7.85153 6.72276 7.76189 6.91045C7.68585 7.05007 7.55858 7.15473 7.4069 7.20237C7.25522 7.25001 7.09097 7.23693 6.94875 7.16587C6.80653 7.09481 6.69743 6.97133 6.64445 6.82143C6.59147 6.67153 6.59873 6.50692 6.66471 6.36227C6.82835 6.03336 7.08444 5.68645 7.48044 5.423C7.87971 5.15545 8.38453 5 9.00308 5C9.54144 5 10.1232 5.15955 10.5854 5.50645C10.8432 5.69485 11.0522 5.94207 11.195 6.22755C11.3379 6.51303 11.4106 6.82851 11.4069 7.14773C11.4069 7.99291 10.9872 8.555 10.5666 8.96C10.4112 9.10973 10.2402 9.25291 10.0929 9.37564L9.97262 9.47627C9.84643 9.57949 9.72751 9.69131 9.61671 9.81091V10.9318C9.61671 11.0946 9.55206 11.2506 9.43698 11.3657C9.3219 11.4808 9.16582 11.5455 9.00308 11.5455C8.84033 11.5455 8.68425 11.4808 8.56917 11.3657C8.45409 11.2506 8.38944 11.0946 8.38944 10.9318V9.72664C8.38944 9.53273 8.44426 9.31427 8.59153 9.12445C8.77153 8.89536 8.98917 8.70145 9.17898 8.54027L9.32871 8.41509L9.32953 8.41427C9.47026 8.29727 9.59462 8.19336 9.71408 8.07718C10.0152 7.78673 10.1796 7.52409 10.1796 7.14773C10.1832 7.01906 10.1549 6.89151 10.0973 6.77644C10.0396 6.66137 9.95432 6.56237 9.84908 6.48827C9.6298 6.32382 9.31726 6.22727 9.00308 6.22727C8.59889 6.22727 8.33708 6.32627 8.16035 6.44409ZM9.82126 13.5909C9.82126 13.8079 9.73506 14.016 9.58162 14.1695C9.42818 14.3229 9.22007 14.4091 9.00308 14.4091C8.78608 14.4091 8.57797 14.3229 8.42453 14.1695C8.2711 14.016 8.18489 13.8079 8.18489 13.5909C8.18489 13.3739 8.2711 13.1658 8.42453 13.0124C8.57797 12.8589 8.78608 12.7727 9.00308 12.7727C9.22007 12.7727 9.42818 12.8589 9.58162 13.0124C9.73506 13.1658 9.82126 13.3739 9.82126 13.5909Z"
                        fill="#070707"
                    />
                    <path
                        d="M9 0.5C13.9705 0.5 18 4.52955 18 9.5C18 14.4705 13.9705 18.5 9 18.5C4.02955 18.5 0 14.4705 0 9.5C0 4.52955 4.02955 0.5 9 0.5ZM1.22727 9.5C1.22727 11.5615 2.04618 13.5385 3.50385 14.9961C4.96152 16.4538 6.93854 17.2727 9 17.2727C11.0615 17.2727 13.0385 16.4538 14.4961 14.9961C15.9538 13.5385 16.7727 11.5615 16.7727 9.5C16.7727 7.43854 15.9538 5.46152 14.4961 4.00385C13.0385 2.54618 11.0615 1.72727 9 1.72727C6.93854 1.72727 4.96152 2.54618 3.50385 4.00385C2.04618 5.46152 1.22727 7.43854 1.22727 9.5Z"
                        fill="#070707"
                    />
                </svg>
                <span className="message-info-wrapper">
                    <span className="message-info">
                        <ul>
                            <li>
                                <span>Новое</span>: лот не был в носке и не имеет повреждений или нюансов. Форма
                                аксессуара сохранена.
                            </li>
                            <li>
                                <span>Отличное</span>: лот внешне выглядит отлично, аксессуар носился мало и бережно.
                                Могут присутствовать следующие нюансы: минимальное изменение формы у сумки, потертость
                                без конкретных видимых дефектов, локальные небольшие восстановления.
                            </li>
                            <li>
                                <span>Хорошее</span>: присутствуют значительные следы носки. Могут присутствовать
                                следующие нюансы: отсутствие элементов полного комплекта, загар, потертости или царапины
                                на коже, пятна на материале, следы носки на подкладке, потертости на фурнитуре, сумка
                                была в спа
                            </li>
                        </ul>
                    </span>
                </span>
            </h3>

            {condition ? (
                <div className="product-content-info-state-bar">
                    {['Хорошее', 'Отличное', 'Новое'].map((conditionItem, index) => (
                        <div
                            className={getClassNames('product-content-info-state-bar-item', {
                                active: condition.toLocaleLowerCase() === conditionItem.toLocaleLowerCase(),
                            })}
                            key={`product-content-info-state-bar-item-${index}`}
                        >
                            <div className="product-content-info-state-bar-item-circle"></div>

                            <p className="product-content-info-state-bar-item__title">{conditionItem}</p>
                        </div>
                    ))}
                </div>
            ) : null}

            {!!nuances && (
                <ProductInfoProperty
                    title="Следы жизни:"
                    value={nuances}
                    className="product-content-info-state__info"
                />
            )}
        </div>
    );
};

export default ProductInfoState;
